<!DOCTYPE html>
<html dir="ltr" lang="gl">
    <head>
        <title>
            Diapositiva predefinida de t&iacute;tulo
        </title>
        <meta content="text/html; charset=UTF-8" http-equiv="content-type">
        <meta http-equiv="Content-Language" content="gl-GL" <meta content="ffDiaporama Team" name="author">
        <link rel="stylesheet" type="text/css" href="wiki.css"/>
    </head>
    <body>
        <div>
             As diapositivas predefinidas de t&iacute;tulo, son diapositivas completas que incl&uacute;en formato e animaci&oacute;ns. 
            <br>
            O interese principal destas diapositivas &eacute; a estandarizaci&oacute;n das diapositivas nun proxecto ou en varios proxectos.
            <br>
            <br>
            ffDiaporama incl&uacute;e moitas diapositivas predefinidas de t&iacute;tulo, mais vostede pode definir as s&uacute;as propias diapositivas predefinidas de t&iacute;tulo. 
            <br>
            Para elo, crear unha diapositiva est&aacute;ndar utilizando a xanela de di&aacute;logo <a href="0119.html">Propiedades de diapositiva</a> e gardar a diapositiva como modelo usando: 
            <ul>
                <li>
                    <img src="img/db_menu_big.png">
                     A funci&oacute;n &laquo;Gardar como modelo&raquo;.
                </li>
            </ul>
        </div>
        <h4>
            Observaci&oacute;ns:
        </h4>
        <div>
            <ul>
                <li>
                    As diapositivas predefinidas de t&iacute;tulo, def&iacute;nense segundo as tres categor&iacute;as seguintes: 
                    <table border="1" cellpadding="2" cellspacing="0">
                        <tbody>
                            <tr>
                                <td nowrap valign="top">
                                    <img src="img/object_text.png">
                                    T&iacute;tulo do proxecto
                                </td>
                                <td>
                                    Este tipo de diapositiva usase xeralmente no principio do proxecto como cr&eacute;ditos iniciais. 
                                    <br>
                                    As vari&aacute;beis de textos que son utilizadas polos modelos deste tipo de diapositivas bas&eacute;anse  unicamente na informaci&oacute;n do proxecto. Para obter m&aacute;is informaci&oacute;n sobre a informaci&oacute;n do proxecto, consulte: <a href="0108.html">Propiedades do proxecto</a>
                                </td>
                            </tr>
                            <tr>
                                <td nowrap valign="top">
                                    <img src="img/Chapter_big.png">
                                    T&iacute;tulo do cap&iacute;tulo
                                </td>
                                <td>
                                    Este tipo de diapositiva utilizase polo xeral varias veces no proxecto para marcar o comezo do cap&iacute;tulo. 
                                    <br>
                                    As vari&aacute;beis de textos que son utilizadas polos modelos deste tipo de diapositivas bas&eacute;anse na informaci&oacute;n do proxecto e na informaci&oacute;n do cap&iacute;tulo.
                                </td>
                            </tr>
                            <tr>
                                <td nowrap valign="top">
                                    <img src="img/medal.png">
                                    T&iacute;tulo do cr&eacute;dito
                                </td>
                                <td>
                                    Este tipo de diapositiva usase xeralmente no final do proxecto como cr&eacute;ditos finais. 
                                    <br>
                                    As vari&aacute;beis de textos que son utilizadas polos modelos deste tipo de diapositiva calc&uacute;lanse automaticamente. Para obter m&aacute;is informaci&oacute;n sobre as vari&aacute;beis de textos, consulte: <a href="0013.html">Vari&aacute;beis din&aacute;micas</a>
                                </td>
                            </tr>
                        </tbody>
                    </table>
                    <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
                </li>
                <li>
                    Dentro de cada categor&iacute;a, as diapositivas predefinidas de t&iacute;tulo clasif&iacute;canse nos seguintes tipos: 
                    <table border="1" cellpadding="2" cellspacing="0">
                        <tbody>
                            <tr>
                                <td nowrap valign="top">
                                    Modelos est&aacute;ticos
                                </td>
                                <td>
                                    Este tipo lista os modelos est&aacute;ticos, sen animaci&oacute;n.
                                </td>
                            </tr>
                            <tr>
                                <td nowrap valign="top">
                                    Modelos animados
                                </td>
                                <td>
                                    Este tipo lista os modelos animados, conte&ntilde;en varias tomas.
                                </td>
                            </tr>
                            <tr>
                                <td nowrap valign="top">
                                    Modelos personalizados
                                </td>
                                <td>
                                    Este tipo lista os modelos que foron gardados coa funci&oacute;n <B><I>Gardar como modelo</I></B> na xanela de d&iacute;alogo <a href="0119.html">Propiedades de diapositiva</a>.
                                </td>
                            </tr>
                        </tbody>
                    </table>
                    <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
                </li>
                <li>
                    <div>
                        Os recursos utilizados polos modelos que se crean non se moven. Polo tanto, se incl&uacute;e unha foto dun modelo, o modelo s&oacute; ser&aacute; v&aacute;lido mentres non se mova a imaxe. &Eacute; por isto que se recomenda, pensar e dese&ntilde;ar os recursos inclu&iacute;dos antes de crear un novo modelo.
                    </div>
                    <span style="background-color:#FFFF00;"> <div>&nbsp;</div></span>
                </li>
                <li>
                    Sempre ser&aacute; pos&iacute;bel crear diapositivas dun modelo usando a xanela de di&aacute;logo <a href="0103.html">Engadir ou editar unha diapositiva predefinida de t&iacute;tulo</a> e despois convertela a unha diapositiva est&aacute;ndar utilizando esta funci&oacute;n:
                    <ul>
                        <li>
                            <img src="img/transparent.png">
                             Converter a diapositiva est&aacute;ndar
                        </li>
                    </ul>
                </li>
            </ul>
        </div>
    </body>
</html>
