<!DOCTYPE html>
<html dir="ltr" lang="gl">
    <head>
        <title>
            Follas de estilo
        </title>
        <meta content="text/html; charset=UTF-8" http-equiv="content-type">
        <meta http-equiv="Content-Language" content="gl-GL" <meta content="ffDiaporama Team" name="author">
        <link rel="stylesheet" type="text/css" href="wiki.css"/>
    </head>
    <body>
        <div>
            ffDiaporama utiliza un sistema de follas de estilo para facilitar o axuste de varias cousas.
        </div>
        <div>
            <br>
            Existen follas de estilo para:
        </div>
        <ul>
            <li>
                O control das coordenadas do bloque, inclu&iacute;ndo os par&aacute;metros de tama&ntilde;o, posici&oacute;n e rotaci&oacute;n de bloques, as&iacute; como o estilo do cadro.
            </li>
            <li>
                O control da forma do bloque, que incl&uacute;e os par&aacute;metros de forma, opacidade, sombra e os bordos do bloque .
            </li>
            <li>
                O control do encadre da imaxe, que incl&uacute;e os par&aacute;metros de restrici&oacute;n da xeometr&iacute;a e tama&ntilde;o.
            </li>
            <li>
                O formatado do texto, que incl&uacute;e os par&aacute;metros do tipo de letra, os atributos dos caracteres, o ali&ntilde;amento e a sombra do texto.
            </li>
            <li>
                O control do fondo do texto, que incl&uacute;e os par&aacute;metros de fondo (cor, dese&ntilde;o, etc).
            </li>
        </ul>
        <div>
            <img src="img/db_menu.png">
             Abrir o men&uacute; de estilo:
        </div>
        <ul>
            <li>
                A primeira parte do men&uacute; enumera os estilos co&ntilde;ecidos.
                <ul>
                    <li>
                        Se os valores actuais corresponden a un estilo co&ntilde;ecido, este estilo est&aacute; marcado cun asterisco.
                    </li>
                    <li>
                        Os estilos est&aacute;ndar de ffDiaporama est&aacute;n marcados con esta icona:
                        <img src="img/db.png">
                    </li>
                    <li>
                        Os estilos est&aacute;ndar que foron modificadoe e os estilos que creo vostede est&aacute;n marcados con esta icona: 
                        <img src="img/db_update.png">
                    </li>
                </ul>
                <br>
            </li>
            <li>
                A segunda parte do men&uacute; perm&iacute;telle modificar a lista de estilos.
                <ul>
                    <li>
                        Crear un novo estilo: perm&iacute;telle crear un novo estilo coa configuraci&oacute;n actual. Ao seleccionar esta opci&oacute;n, aparecer&aacute; un di&aacute;logo que solicitar&aacute;lle o nome que lle quere dar ao novo estilo.
                    </li>
                    <li>
                        Modificar un estilo existente: perm&iacute;telle cambiar a configuraci&oacute;n dun estilo existente mediante o uso da configuraci&oacute;n actual. Ao seleccionar esta opci&oacute;n, aparecer&aacute; a lista de estilos co&ntilde;ecidos. Seleccione o estilo que quere modificar.
                    </li>
                    <li>
                        Xestionar estilos: abrir o di&aacute;logo Xestionar o estilo.
                    </li>
                </ul>
            </li>
        </ul>
    </body>
</html>
