<!DOCTYPE html>
<html dir="ltr" lang="gl">
    <head>
        <title>
            A xanela principal
        </title>
        <meta content="text/html; charset=UTF-8" http-equiv="content-type">
        <meta http-equiv="Content-Language" content="gl-GL" <meta content="ffDiaporama Team" name="author">
        <link rel="stylesheet" type="text/css" href="wiki.css"/>
    </head>
    <body>
        <div>
            A xanela principal de ffDiaporama permite seleccionar todas as tarefas com&uacute;ns para xestionar as diapositivas.
        </div>
        <br>
        <div>
            O principio xeral &eacute;:
        </div>
        <ul>
            <li>
                Engadir ficheiros e t&iacute;tulos a <a href="0023.html">li&ntilde;a de tempo</a> en forma de diapositivas
            </li>
            <li>
                Organizar as diapositivas
            </li>
            <li>
                Axustar as diapositivas e crear animaci&oacute;ns
            </li>
        </ul>
        <div>
            Para xestionar as diapositivas, ffDiaporama fornece tres modos visuais:
        </div>
        <br>
        <table border="1" cellpadding="2" cellspacing="0">
            <tbody>
                <tr>
                    <td style="vertical-align: top;">
                        Modo navegador de ficheiros
                    </td>
                    <td style="vertical-align: top;">
                        Neste modo, a xanela principal div&iacute;dese en 3 zonas:
                        <ul>
                            <li>
                                A <a href="0022.html">barra de ferramentas</a> e o men&uacute; superior
                            </li>
                            <li>
                                A <a href="0023.html">li&ntilde;a de tempo</a>
                            </li>
                            <li>
                                O <a href="0024.html">navegador de ficheiros multimedia</a>
                            </li>
                        </ul>
                         Neste modo, poden amosarse os ficheiros multimedia presentes nos discos r&iacute;xidos e inserilos mediante arrastrar e soltar na <a href="0023.html">li&ntilde;a de tempo</a> para crear un diaporama.
                        <br>
                        Arriba &aacute; dereita, preto da barra de ferramentas e men&uacute;s, poder&aacute; ver un reprodutor multimedia, que lle permite unha vista previa do diaporama.
                        <br>
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                        Modo de follas
                    </td>
                    <td style="vertical-align: top;">
                        Neste modo, a xanela principal div&iacute;dese en 2 zonas:
                        <ul>
                            <li>
                                A <a href="0022.html">barra de ferramentas</a> e o men&uacute; superior
                            </li>
                            <li>
                                A <a href="0023.html">li&ntilde;a de tempo</a>
                            </li>
                        </ul>
                         Neste modo, a <a href="0023.html">li&ntilde;a de tempo</a> presentase en varias li&ntilde;as para amosar a maior cantidade pos&iacute;bel de diapositivas do diaporama. As diapositivas am&oacute;sanse como nunha partitura musical, en forma de li&ntilde;a, e na fin dunha li&ntilde;a p&aacute;sase ao principio da seguinte.
                        <br>
                        Pode reorganizar as diapositivas mov&eacute;ndoas mediante arrastrar e soltar na <a href="0023.html">li&ntilde;a de tempo</a>.
                        <br>
                        Arriba &aacute; dereita, preto da barra de ferramentas e men&uacute;s, poder&aacute; ver un reprodutor multimedia, que lle permite unha vista previa do diaporama.
                        <br>
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                        Modo de vista previa
                    </td>
                    <td style="vertical-align: top;">
                        Neste modo, a xanela principal div&iacute;dese en 3 zonas:
                        <ul>
                            <li>
                                A <a href="0022.html">barra de ferramentas</a> e o men&uacute; superior
                            </li>
                            <li>
                                A <a href="0023.html">li&ntilde;a de tempo</a>
                            </li>
                            <li>
                                Un gran reprodutor multimedia
                            </li>
                        </ul>
                         Neste modo, pode obter unha vista previa do diaporama en tama&ntilde;o grande.
                        <br>
                        Pode modificar as diapositivas e facer unha vista previa dos cambios no reprodutor multimedia
                    </td>
                </tr>
            </tbody>
        </table>
        <div>
            <br>
            Para cambiar o modo de vista, utilice os bot&oacute;ns situados na barra de estado, na parte inferior dereita da xanela principal.
        </div>
        <ul>
            <li>
                <img src="img/FolderOpen.png">
                 Cambiar a vista ao modo de ficheiro
            </li>
            <li>
                <img src="img/journal.png">
                 Cambiar a vista ao modo de follas
            </li>
            <li>
                <img src="img/player_play_small.png">
                 Cambiar a vista ao modo de vista previa
            </li>
        </ul>
        <div>
            A edici&oacute;n de diapositivas faise:
        </div>
        <ul>
            <li>
                usando os bot&oacute;ns situados na <a href="0022.html">barra de ferramentas</a>
            </li>
            <li>
                usando o men&uacute; contextual (bot&oacute;n dereito do rato sobre un elemento)
            </li>
            <li>
                premendo d&uacute;as veces nos elementos da diapositiva
            </li>
        </ul>
    </body>
</html>
