<!DOCTYPE html>
<html dir="ltr" lang="gl">
    <head>
        <title>
            O navegador de ficheiros multimedia
        </title>
        <meta content="text/html; charset=UTF-8" http-equiv="content-type">
        <meta http-equiv="Content-Language" content="gl-GL" <meta content="ffDiaporama Team" name="author">
        <link rel="stylesheet" type="text/css" href="wiki.css"/>
    </head>
    <body>
        <div>
            ffDiaporama fornece un navegador de ficheiros multimedia que se amosa na xanela principal cando se selecciona o modo de navegador de ficheiros. Est&aacute; dese&ntilde;ado para un acceso r&aacute;pido aos ficheiros multimedia no computador.
        </div>
        <div>
            As principais vantaxes son que pode verse a informaci&oacute;n multimedia de ficheiros concretos, incluso antes de engadilos ao proxecto. Por exemplo, p&oacute;dese filtrar a vista para obter informaci&oacute;n s&oacute; das fotos, dos ficheiros de v&iacute;deo ou dos ficheiros de m&uacute;sica.
        </div>
        <div>
            E, ademais, pode seleccionar un ou m&aacute;is ficheiros multimedia e engadilos ao proxecto arrastr&aacute;ndoos e solt&aacute;ndoos.
        </div>
        <div>
            O obxectivo principal do navegador de ficheiros &eacute; a vista e o uso de ficheiros multimedia. Para unha maior comodidade int&eacute;granse algunhas das tarefas de xesti&oacute;n de ficheiros, p.ex. a creaci&oacute;n de cartafoles, a eliminaci&oacute;n de ficheiros e o renomeado de ficheiros ou cartafoles.
        </div>
        <br>
        <h4>
            Observaci&oacute;n:
        </h4>
        <ul>
            <li>
                Os ficheiros poden ser presentados de xeito diferente a como o fai o navegador de ficheiros do sistema (presencia de filtros que amosan s&oacute; alg&uacute;ns ficheiros, Xesti&oacute;n dos pares ficheiro/icona, etc.)
            </li>
            <li>
                O navegador de ficheiros multimedia axustase &aacute;s regras de vista utilizados pola maior&iacute;a dos sistemas multimedia (pasarela, disco r&iacute;xido multimedia, etc.):
                <ul>
                    <li>
                        Se un dispositivo ou cartafol cont&eacute;n un ficheiro &laquo;folder.jpg&raquo;, ent&oacute;n, utilizase este ficheiro de imaxe como icona do dispositivo ou do cartafol
                    </li>
                    <li>
                        Se un ficheiro de v&iacute;deo ou de m&uacute;sica vai acompa&ntilde;ado dun ficheiro de imaxe coa extensi&oacute;n &laquo;.jpg&raquo; e leva o mesmo nome, utilizase ese ficheiro de imaxe como icona para o ficheiro (por exemplo: vacaci&oacute;ns.mkv e vacaci&oacute;ns.jpg no mesmo cartafol
                    </li>
                </ul>
            </li>
            <li>
                O navegador de ficheiros multimedia de ffDiaporama non est&aacute; dese&ntilde;ado para manexar ficheiros: polo que no pode facer copias de ficheiros ou mover ficheiros.
            </li>
        </ul>
        <h2>
            <img src="img/MediaIcons/16x16/directory.png">
             &Aacute;rbore de cartafoles
        </h2>
        <div style="margin-left: 40px;">
            <div>
                A &aacute;rbore de cartafoles amosa os dispositivos e cartafoles do sistema. En cada dispositivo est&aacute;n listados os cartafoles dese dispositivo, baixo os cartafoles os subcartafoles, se os ten, e as&iacute; sucesivamente.
            </div>
            <div>
                P&oacute;dese:
            </div>
            <ul>
                <li>
                    Premer nun dispositivo ou cartafol para seleccionalo
                </li>
                <li>
                    Prema no tri&aacute;ngulo que precede ao nome do dispositivo ou do cartafol para amosar ou agochar a lista de subcartafoles
                </li>
                <li>
                    Prema co bot&oacute;n dereito do rato nun dispositivo ou cartafol para abrir o men&uacute; contextual sobre ese dispositivo ou cartafol. O men&uacute; contextual presenta as seguintes opci&oacute;ns:
                    <ul>
                        <li>
                            <B>Actualizar todo</B> para actualizar toda a &aacute;rbore (por exemplo, ao inserir un CD-ROM, un DVD ou un dispositivo USB, para que estes sexan amosados na &aacute;rbore)
                        </li>
                        <li>
                            <B>Actualizar desde aqu&iacute;</B> para actualizar a &aacute;rbore neste cartafol (actualizar s&oacute; o que estea nese cartafol)
                        </li>
                        <li>
                            Crear un novo cartafol
                        </li>
                        <li>
                            Retirar un cartafol
                        </li>
                        <li>
                            Renomear un cartafol
                        </li>
                    </ul>
                </li>
            </ul>
            <br>
            <div>
                A vista actual de cartafoles amosa os ficheiros e subcartafoles presente no cartafol actual.
            </div>
            <div>
                Os ficheiros am&oacute;sanse:
                <ul>
                    <li>
                        Sexa como unha t&aacute;boa con abondosa informaci&oacute;n se seleccionou a vista de detalles no men&uacute; de axustes do navegador
                    </li>
                    <li>
                        Ou como imaxe se seleccionou a vista de iconas no men&uacute; de axustes do navegador
                    </li>
                </ul>
            </div>
            <br>
            <div>
                Os ficheiros am&oacute;sanse segundo o filtro de selecci&oacute;n de ficheiros no men&uacute; de axustes do navegador
            </div>
            <div>
                P&oacute;dese:
                <ul>
                    <li>
                        Seleccione un ficheiro ou cartafol premendo nel
                    </li>
                    <li>
                        Seleccione varios ficheiros ou cartafoles empregando as teclas MAI&Uacute;S e CTRL
                        <ul>
                            <li>
                                CTRL+Clic nun ficheiro: Eng&aacute;deo ou ret&iacute;rao da selecci&oacute;n actual
                            </li>
                            <li>
                                MAI&Uacute;S+clic nun ficheiro: Selecciona todos os ficheiros entre o &uacute;ltimo seleccionado e o que se ven de premer nel
                            </li>
                        </ul>
                    </li>
                    <li>
                        Dobre clic nun ficheiro ou cartafol:
                        <ul>
                            <li>
                                Se &eacute; un cartafol: seleccionalo como cartafol actual e abrilo
                            </li>
                            <li>
                                De tratase dun ficheiro: abrir&aacute; o programa que estea asociado de xeito predeterminado ao tipo de ficheiro no sistema. Por exemplo, se GIMP foi asociado con .jpg no navegador/xestor de ficheiros do sistema, ent&oacute;n, premer d&uacute;as veces nun ficheiro .jpg abrir&aacute; o ficheiro co GIMP. (Observaci&oacute;n: Premer d&uacute;as veces nun ficheiro de proxecto de ffDiaporama, abre o proxecto ffDiaporama)
                            </li>
                        </ul>
                    </li>
                    <li>
                        Prema co bot&oacute;n dereito do rato nun dos ficheiros ou cartafoles da selecci&oacute;n para abrir o men&uacute; contextual. Segundo os elementos que estean presentes na selecci&oacute;n, o men&uacute; proporalle diferentes acci&oacute;ns
                    </li>
                </ul>
            </div>
            <br>
            <div>
                Tam&eacute;n pode utilizar arrastrar e soltar para mover os ficheiros seleccionados cara a li&ntilde;a de tempo:
                <ul>
                    <li>
                        Engadir ao proxecto, se se trata de imaxes, v&iacute;deos ou ficheiros de proxecto ffDiaporama
                    </li>
                    <li>
                        Utilizalos como unha lista de reproduci&oacute;n, se se trata de ficheiros de son
                    </li>
                </ul>
            </div>
        </div>
        <h2>
            Barra de estado da selecci&oacute;n actual
        </h2>
        <div style="margin-left: 40px;">
            A barra de estado da selecci&oacute;n actual amosa informaci&oacute;n sobre un ou varios ficheiros seleccionados.
        </div>
        <br>
        <div style="margin-left: 40px;">
            Para unha selecci&oacute;n simple de ficheiro, amosase a seguinte informaci&oacute;n :
        </div>
        <table border="1" cellpadding="2" cellspacing="0">
            <tbody>
                <tr>
                    <td rowspan="3">
                        Imaxe do ficheiro
                    </td>
                    <td>
                        Nome do ficheiro (tama&ntilde;o do ficheiro)
                    </td>
                </tr>
                <tr>
                    <td>
                        Segundo o tipo de ficheiro: 
                        <br>
                        Imaxe: Informaci&oacute;n sobre o tama&ntilde;o da imaxe / dereitos de autor&iacute;a / c&aacute;mara / orientaci&oacute;n
                        <br>
                        V&iacute;deo: Informaci&oacute;n sobre o formato das imaxes / a pista de v&iacute;deo / a pista de son / duraci&oacute;n
                        <br>
                        M&uacute;sica: Informaci&oacute;n sobre o formato do son / duraci&oacute;n
                        <br>
                        Proxecto de ffDiaporama: Versi&oacute;n de ffDiaporama / formato / n&uacute;mero de diapositiva e cap&iacute;tulo / duraci&oacute;n do proxecto
                    </td>
                </tr>
                <tr>
                    <td>
                        Segundo o tipo de ficheiro: 
                        <br>
                        Imaxe: Informaci&oacute;n sobre a toma de fotograf&iacute;as (apertura e foco / obxectivo / con ou sen flash)
                        <br>
                        V&iacute;deo: contido da etiqueta TAG (T&iacute;tulo / Interprete (Artista) / &Aacute;lbum / Ano)
                        <br>
                        M&uacute;sica: contido da etiqueta TAG (T&iacute;tulo / Interprete (Artista) / &Aacute;lbum / Ano)
                        <br>
                        Proxecto de ffDiaporama: contido da etiqueta TAG (T&iacute;tulo / Interprete (Artista) / &Aacute;lbum / Ano)
                    </td>
                </tr>
            </tbody>
        </table>
        <br>
        <div style="margin-left: 40px;">
            Para unha selecci&oacute;n m&uacute;ltiple de ficheiros, amosase a seguinte informaci&oacute;n :
        </div>
        <table border="1" cellpadding="2" cellspacing="0">
            <tbody>
                <tr>
                    <td rowspan="3">
                        Icona do tipo de ficheiro
                    </td>
                    <td>
                        N&uacute;mero de ficheiros e tipo de ficheiros
                    </td>
                </tr>
                <tr>
                    <td>
                        Duraci&oacute;ns acumuladas dos ficheiros
                    </td>
                </tr>
                <tr>
                    <td>
                        Tama&ntilde;o acumulado dos ficheiros
                    </td>
                </tr>
            </tbody>
        </table>
        <br>
        <h2>
            Barra de estado do cartafol actual
        </h2>
        <div style="margin-left: 40px;">
            A barra de estado do cartafol actual amosa a seguinte informaci&oacute;n sebre o cartafol actual:
        </div>
        <table border="1" cellpadding="2" cellspacing="0">
            <tbody>
                <tr>
                    <td>
                        <img src="img/MediaIcons/16x16/file.png">
                         N&uacute;mero de ficheiros
                    </td>
                    <td>
                        <img src="img/MediaIcons/16x16/directory.png">
                         N&uacute;mero de subcartafoles
                    </td>
                </tr>
                <tr>
                    <td>
                        <img src="img/MediaIcons/16x16/hdd.png">
                         Tama&ntilde;o total dos ficheiros amosados
                    </td>
                    <td>
                        <img src="img/MediaIcons/16x16/delayed.png">
                         Duraci&oacute;n total dos ficheiros amosados
                    </td>
                </tr>
                <tr>
                    <td colspan="2" style="text-align: center;">
                        Espazo ocupado no disco / espazo total do disco
                    </td>
                </tr>
            </tbody>
        </table>
        <br>
        <h2>
            <img src="img/favorite_menu.png">
             Men&uacute; de favoritos
        </h2>
        <div style="margin-left: 40px;">
            <div>
                A lista de cartafoles preferidos pode xestionarse no men&uacute; de preferencias.
            </div>
            <ul>
                <li>
                    Primeira li&ntilde;a do men&uacute;: 
                    <img src="img/favorite_add.png">
                    <U><B> Engadir a preferencias</B></U> engade o cartafol actual &aacute; lista. Ent&oacute;n unha xanela de edici&oacute;n permitiralle darlle un nome a esta preferencia
                </li>
                <li>
                    Entre a primeira e a &uacute;ltima li&ntilde;a: 
                    <img src="img/favorite.png">
                     Amosase <U><B>A lista de cartafoles preferidos</B></U>. Seleccione un dos cartafoles preferidos para acceder a el directamente
                </li>
                <li>
                    &Uacute;ltima li&ntilde;a do men&uacute;: 
                    <img src="img/favorite_manage.png">
                    <U><B> Xestionar preferencia</B></U> permite cambiar o nome ou eliminar entradas da lista. Aparecer&aacute; un di&aacute;logo para modificar a lista amosada
                </li>
            </ul>
        </div>
        <br>
        <h2>
            <img src="img/config_menu.png">
             Men&uacute; de configuraci&oacute;n
        </h2>
        <div style="margin-left: 40px;">
            O men&uacute; de axustes permite modificar a vista do cartafol actual:
        </div>
        <br>
        <table border="0" cellpadding="2" cellspacing="0">
            <tbody>
                <tr>
                    <td colspan="3">
                        <h4>
                            Axustes do modo de vista
                        </h4>
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                        <img src="img/DISPLAY_DATA.png">
                    </td>
                    <td style="vertical-align: top;">
                        Vista en detalle
                    </td>
                    <td style="vertical-align: top;">
                        Cambiar a vista do cartafol actual ao modo de detalle. Neste modo, os elementos presentes no cartafol am&oacute;sanse nunha t&aacute;boa con abondosa informaci&oacute;n
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                        <img src="img/DISPLAY_JUKEBOX.png">
                    </td>
                    <td style="vertical-align: top;">
                        Vista en iconas
                    </td>
                    <td style="vertical-align: top;">
                        Cambiar a vista do cartafol actual ao modo de icona. Neste modo, os elementos presentes no cartafol am&oacute;sanse como imaxes
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                    </td>
                    <td style="vertical-align: top;">
                    </td>
                    <td style="vertical-align: top;">
                    </td>
                </tr>
                <tr>
                    <td colspan="3">
                        <h4>
                            Axustes da forma de ordenar
                        </h4>
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                        <img src="img/SortByNumber.png">
                    </td>
                    <td style="vertical-align: top;">
                        Ordenar polo n&uacute;mero
                    </td>
                    <td style="vertical-align: top;">
                        Esta opci&oacute;n ordena os ficheiros segundo a orden do seu sufixo num&eacute;rico: Exemplo: se selecciona IMG_0025, IMG_0032, MVI_0029 e MVI_0040, os ficheiros inseriranse na seguinte orden: IMG_0025, MVI_0029, IMG_0032 e MVI_0040
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                        <img src="img/SortByDate.png">
                    </td>
                    <td style="vertical-align: top;">
                        Ordenar pola data
                    </td>
                    <td style="vertical-align: top;">
                        Esta opci&oacute;n ordena os ficheiros segundo a data de creaci&oacute;n
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                        <img src="img/SortByName.png">
                    </td>
                    <td style="vertical-align: top;">
                        Ordenar polo nome
                    </td>
                    <td style="vertical-align: top;">
                        Esta opci&oacute;n ordena os ficheiros en orde alfab&eacute;tica
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                        <img src="img/SortByDate.png">
                    </td>
                    <td style="vertical-align: top;">
                        Ordenar pola data
                    </td>
                    <td style="vertical-align: top;">
                        Esta opci&oacute;n ordena os ficheiros segundo a data da &uacute;ltima modificaci&oacute;n
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                        <img src="img/MediaIcons/16x16/directory.png">
                    </td>
                    <td style="vertical-align: top;">
                        Amosar primeiro os cartafoles
                    </td>
                    <td style="vertical-align: top;">
                        Se activa esta opci&oacute;n, amosaranse primeiro os directorios (cartafoles)
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                    </td>
                    <td style="vertical-align: top;">
                    </td>
                    <td style="vertical-align: top;">
                    </td>
                </tr>
                <tr>
                    <td colspan="3">
                        <h4>
                            Axustes do filtro sobre os ficheiros
                        </h4>
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                        <img src="img/MediaIcons/16x16/file.png">
                    </td>
                    <td style="vertical-align: top;">
                        Todos os ficheiros
                    </td>
                    <td style="vertical-align: top;">
                        Amosar todos os elementos presentes no cartafol actual
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                        <img src="img/MediaIcons/16x16/file.png">
                    </td>
                    <td style="vertical-align: top;">
                        Ficheiros xestionados
                    </td>
                    <td style="vertical-align: top;">
                        Limitar a vista dos elementos utiliz&aacute;beis do cartafol actual:
                        <ul>
                            <li>
                                Ficheiros de imaxe, v&iacute;deo e son, cuxo formato &eacute; reco&ntilde;ecido por ffDiaporama
                            </li>
                            <li>
                                Subcartafoles
                            </li>
                        </ul>
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                        <img src="img/MediaIcons/16x16/image.png">
                    </td>
                    <td style="vertical-align: top;">
                        Ficheiros de imaxe
                    </td>
                    <td style="vertical-align: top;">
                        Limitar a vista do cartafol actual aos ficheiros de imaxe cuxo formato &eacute; reco&ntilde;ecido por ffDiaporama nos subcartafoles presentes
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                        <img src="img/MediaIcons/16x16/image.png">
                    </td>
                    <td style="vertical-align: top;">
                        Ficheiros de imaxe vectoriais
                    </td>
                    <td style="vertical-align: top;">
                        Limitar a vista do cartafol actual aos ficheiros de imaxe vectorial cuxo formato &eacute; reco&ntilde;ecido por ffDiaporama nos subcartafoles presentes
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                        <img src="img/MediaIcons/16x16/video.png">
                    </td>
                    <td style="vertical-align: top;">
                        Ficheiros de v&iacute;deo
                    </td>
                    <td style="vertical-align: top;">
                        Limitar a vista do cartafol actual aos ficheiros de v&iacute;deo cuxo formato &eacute; reco&ntilde;ecido por ffDiaporama nos subcartafoles presentes
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                        <img src="img/MediaIcons/16x16/audio.png">
                    </td>
                    <td style="vertical-align: top;">
                        Ficheiros de son
                    </td>
                    <td style="vertical-align: top;">
                        Limitar a vista do cartafol actual aos ficheiros de son cuxo formato &eacute; reco&ntilde;ecido por ffDiaporama nos subcartafoles presentes
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                        <img src="img/MediaIcons/16x16/ffDiaporama.png">
                    </td>
                    <td style="vertical-align: top;">
                        Proxectos do ffDiaporama
                    </td>
                    <td style="vertical-align: top;">
                        Limitar a vista do cartafol actual aos ficheiros de proxecto de ffDiaporama nos subcartafoles presentes
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                    </td>
                    <td style="vertical-align: top;">
                    </td>
                    <td style="vertical-align: top;">
                    </td>
                </tr>
                <tr>
                    <td colspan="3">
                        <h4>
                            Configuraci&oacute;n adicional
                        </h4>
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                        <div>
                            <img src="img/Visible_OK.png">
                        </div>
                    </td>
                    <td style="vertical-align: top;">
                        Amosar os ficheiros e cartafoles agochados
                    </td>
                    <td style="vertical-align: top;">
                        Amosar ou agochar os ficheiros e cartafoles agochados.
                        <br>
                        En Windows, os ficheiros e cartafoles agochados te&ntilde;en o atributo de ficheiro <B>Hide</B> activado.
                        <br>
                        En Linux, nos ficheiros e cartafoles agochados o seu nome comeza por un punto &laquo;.&raquo;
                        <br>
                        Esta opci&oacute;n acumula ambas versi&oacute;ns para ambos sistemas. Polo tanto, incluso en Windows, os ficheiros e cartafoles cuxo nome comece por un punto &laquo;.&raquo; son considerados como ficheiros ou cartafoles agochados.
                        <br>
                        Observaci&oacute;n: 
                        <img src="img/Visible_OK.png">
                         ou 
                        <img src="img/Visible_KO.png">
                         Unha destas iconas aparece diante do nome da opci&oacute;n, estea este activado ou non.
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                        <img src="img/Visible_KO.png">
                    </td>
                    <td style="vertical-align: top;">
                        Agochar o nome de ficheiro
                    </td>
                    <td style="vertical-align: top;">
                        Esta opci&oacute;n s&oacute; est&aacute; dispo&ntilde;&iacute;bel para o modo de vista de iconas. Se activa esta opci&oacute;n, non se amosar&aacute;n os nomes de ficheiro nos ficheiros de imaxe. Isto permite aumentar o n&uacute;mero de imaxes a que se amosan na vista do cartafol (directorio) actual.
                        <br>
                        Observaci&oacute;n: 
                        <img src="img/Visible_OK.png">
                         ou 
                        <img src="img/Visible_KO.png">
                         Unha destas iconas aparece diante do nome da opci&oacute;n, estea este activado ou non.
                    </td>
                </tr>
            </tbody>
        </table>
    </body>
</html>
