<!DOCTYPE html>
<html dir="ltr" lang="gl">
    <head>
        <title>
            Xerar v&iacute;deos
        </title>
        <meta content="text/html; charset=UTF-8" http-equiv="content-type">
        <meta http-equiv="Content-Language" content="gl-GL" <meta content="ffDiaporama Team" name="author">
        <link rel="stylesheet" type="text/css" href="wiki.css"/>
    </head>
    <body>
        <div>
            Un v&iacute;deo dixital consiste nun ficheiro de computador chamado <a href="0038.html">contedor</a>
        </div>
        <div>
            Neste ficheiro atopamos:
        </div>
        <ul>
            <li>
                Unha ou m&aacute;is pistas de v&iacute;deo. Cada pista est&aacute; constru&iacute;da utilizando un <a href="0036.html">C&oacute;dec de v&iacute;deo</a>
            </li>
            <li>
                Unha ou m&aacute;is pistas de son. Cada pista est&aacute; constru&iacute;da utilizando un <a href="0037.html">C&oacute;dec de son</a>
            </li>
            <li>
                Posibelmente, un ou m&aacute;is subt&iacute;tulos. Cada subt&iacute;tulo basease nun formato de subt&iacute;tulos.
            </li>
            <li>
                Posibelmente, unha definici&oacute;n de etiquetas e cap&iacute;tulos.
            </li>
        </ul>
        <br>
        <h4>
            Limitaci&oacute;ns:
        </h4>
        <ul>
            <li>
                ffDiaporama non xestiona subt&iacute;tulos.
            </li>
            <li>
                ffDiaporama xera ficheiros que incl&uacute;en unha pista de v&iacute;deo e unha &uacute;nica pista de son.
            </li>
        </ul>
        <div>
            A diferencia dos ficheiros de m&uacute;sica, que son moi port&aacute;beis dun dispositivo a outro, os v&iacute;deos requiren dunha certa cantidade de xogos malabares entre varios formatos para adaptarse aos equipos utilizados para reproducilos.
        </div>
        <div>
            Un v&iacute;deo xerado para un dispositivo de &laquo;Cine na casa&raquo; (Home Cinema) pode ocupar varios GB e non ser&aacute; reproduc&iacute;bel nun tel&eacute;fono intelixente.
        </div>
        <div>
            O mesmo v&iacute;deo xerado para untel&eacute;fono intelixente requerir&aacute; s&oacute; un MB, e poder&aacute; seren reproducido nun dispositivo de &laquo;Cine na casa&raquo; (Home Cinema), mais a reproduci&oacute;n ser&aacute; de moi mala calidade.
        </div>
        <div>
            &Eacute; por isto que se recomenda conservar os ficheiros orixinais do proxecto na medida do pos&iacute;bel, e crear con eles os v&iacute;deos axeitados para os dispositivos que se queira empregar para a reproduci&oacute;n.
        </div>
        <br>
        <div>
            Para simplificar a configuraci&oacute;n da operaci&oacute;n de xerado de v&iacute;deo, ffDiaporama cont&eacute;n axustes xa predefinidos para os seguintes dispositivos:
        </div>
        <ul>
            <li>
                <a href="0032.html">Tel&eacute;fonos intelixentes</a>, <a href="0033.html">dispositivos port&aacute;tiles</a> e pequenos reprodutores en xeral
            </li>
            <li>
                <a href="0034.html">Sistemas multimedia</a> para uso dom&eacute;stico (dispositivos de &laquo;Cine na casa&raquo; (Home Cinema))
            </li>
            <li>
                <a href="0035.html">Ver na Web</a> (blogs, imaxes para compartir e sitios de redes sociais)
            </li>
        </ul>
        <div>
            Tam&eacute;n &eacute; pos&iacute;bel definir todos os par&aacute;metros directamente mediante o uso da opci&oacute;n avanzada.
        </div>
    </body>
</html>
