<!DOCTYPE html>
<html dir="ltr" lang="gl">
    <head>
        <title>
            Xanela de opci&oacute;ns do programa
        </title>
        <meta content="text/html; charset=UTF-8" http-equiv="content-type">
        <meta http-equiv="Content-Language" content="gl-GL" <meta content="ffDiaporama Team" name="author">
        <link rel="stylesheet" type="text/css" href="wiki.css"/>
    </head>
    <body>
        <div>
            Esta xanela de di&aacute;logo perm&iacute;telle definir as opci&oacute;ns do programa. Componse das seguintes 3 lapelas:
        </div>
        <ul>
            <li>
                A lapela &laquo;Opci&oacute;ns do programa&raquo; perm&iacute;telle definir o comportamento xeral de ffDiaporama.
            </li>
            <li>
                A lapela &laquo;Opci&oacute;ns do proxecto&raquo; perm&iacute;telle definir as opci&oacute;ns predeterminadas do proxecto actual e para os novos proxectos.
            </li>
            <li>
                A lapela &laquo;Opci&oacute;ns da xeraci&oacute;n de v&iacute;deo&raquo; perm&iacute;telle definir as opci&oacute;ns predeterminadas a empregar durante a xeraci&oacute;n dos v&iacute;deos.
            </li>
        </ul>
        <h2>
            Opci&oacute;ns do programa
        </h2>
        <div style="margin-left: 40px;">
            <div>
                A lapela &laquo;Opci&oacute;ns do programa&raquo; permite definir o comportamento xeral de ffDiaporama.
            </div>
            <h3>
                Opci&oacute;ns do programa
            </h3>
            <table border="1" cellpadding="2" cellspacing="0">
                <tbody>
                    <tr>
                        <td style="vertical-align: top;">
                            Lembrar o tama&ntilde;o e a posici&oacute;n das xanelas
                        </td>
                        <td style="vertical-align: top;">
                            Se est&aacute; marcada esta caixa, gardaranse os tama&ntilde;os e as posici&oacute;ns de todas as xanelas e caixas de di&aacute;logo para reutilizalas a pr&oacute;xima vez que utilicemos o ffDiaporama.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Lembrar os &uacute;ltimos cartafoles utilizados
                        </td>
                        <td style="vertical-align: top;">
                            Se est&aacute; marcada esta caixa, os directorios de imaxes, v&iacute;deos, m&uacute;sica, proxectos e a xeraci&oacute;n do v&iacute;deo, poden gardarse e reutilizalos a pr&oacute;xima vez que utilice o ffDiaporama.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Activar o sistema gr&aacute;fico &laquo;raster&raquo;
                        </td>
                        <td style="vertical-align: top;">
                            <B>S&oacute; para usuarios de Linux: </B>Se est&aacute; marcada esta caixa, utilizarase o sistema gr&aacute;fico &laquo;raster&raquo; en troques do sistema gr&aacute;fico predeterminado. Esta opci&oacute;n s&oacute; se utiliza ao iniciar o programa.
                            <br>
                            O sistema gr&aacute;fico &laquo;raster&raquo; acelera a pantalla, mais pode presentar problemas nalg&uacute;n equipo, en particular con KDE.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Desactiva as mensaxes emerxentes nas caixas de di&aacute;logo
                        </td>
                        <td style="vertical-align: top;">
                            Se est&aacute; marcada esta caixa, xa non aparecer&aacute;n as mensaxes emerxentes nas xanelas de di&aacute;logo (s&oacute; estar&aacute; dispo&ntilde;&iacute;bel &laquo;Que &eacute; isto?&raquo;).
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Abre a p&aacute;xina web de descargas de novas versi&oacute;ns
                        </td>
                        <td style="vertical-align: top;">
                            Se est&aacute; marcada esta caixa, aparecer&aacute; unha xanela no inicio cando haxa unha nova versi&oacute;n dispo&ntilde;&iacute;bel. 
                            <br>
                            De xeito predeterminado, esta caixa est&aacute; marcada para os usuarios de Windows e sen marcar para os usuarios de Linux
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Perfil da memoria
                        </td>
                        <td style="vertical-align: top;">
                            Define a cantidade de memoria utilizada como memoria cach&eacute; polo ffDiaporama. Este par&aacute;metro &eacute; importante xa que permite adaptar ffDiaporama ao seu hardware. 
                            <br>
                            Para os usuarios de sistemas de 32 bits, recomendase estabelecer este valor en 512 MB ​​se o equipo ten polo menos 2 GB de RAM.
                            <br>
                            Para os usuarios de sistemas de 64 bits, recomendase estabelecer este valor en 2 GB ​​se o equipo ten polo menos 4 GB de RAM.
                        </td>
                    </tr>
                </tbody>
            </table>
            <br>
            <h3>
                Opci&oacute;ns da vista previa
            </h3>
            <table border="1" cellpadding="2" cellspacing="0">
                <tbody>
                    <tr>
                        <td style="vertical-align: top;">
                            Taxa de fotogramas
                        </td>
                        <td style="vertical-align: top;">
                            Define o n&uacute;mero de imaxes por segundo que xerar para amosar a vista previa.
                            <br>
                            Nota: Canto maior sexa este n&uacute;mero, m&aacute;is suave ser&aacute; a vista previa. Por outra banda, require de m&aacute;is recursos do equipo. Reduza este n&uacute;mero en equipos lentos ou se o medidor do seu lector multimedia est&aacute; frecuente na zona vermella.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Altura m&aacute;x. da vista previa do v&iacute;deo
                        </td>
                        <td style="vertical-align: top;">
                            Estabelece a altura m&aacute;xima dos v&iacute;deos utilizados para a vista previa.<br />Ademais desta altura, os v&iacute;deos red&uacute;cense automaticamente para crear imaxes. 
                            <br>
                            Este par&aacute;metro s&oacute; afecta &aacute; vista previa e non cambia a calidade do v&iacute;deo xerado. 
                            <br>
                            Recomendase baixar este valor en equipos lentos.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Suavizar a imaxe (imaxes suaves durante a vista previa)
                        </td>
                        <td style="vertical-align: top;">
                            Se est&aacute; marcada esta caixa, durante a vista previa aplicar&aacute;selle &aacute;s imaxes o efecto de suavizado.
                            <br>
                            Este efecto consume moitos recursos e pode dar como resultado unha vista previa lenta en equipos pequenos. De ser as&iacute;, desmarcar esta caixa para manter un avance flu&iacute;do.
                            <br>
                            Este par&aacute;metro s&oacute; afecta &aacute; vista previa e non cambia a calidade do v&iacute;deo xerado.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Taxa de mostraxe do son
                        </td>
                        <td style="vertical-align: top;">
                            Define a frecuencia do son xerado para amosar a vista previa. 
                            <br>
                            Este par&aacute;metro s&oacute; afecta &aacute; vista previa e non cambia a calidade do v&iacute;deo xerado. 
                            <br>
                            Recomendase baixar este valor en equipos lentos.
                        </td>
                    </tr>
                </tbody>
            </table>
            <br>
            <h3>
                Opci&oacute;ns do editor
            </h3>
            <table border="1" cellpadding="2" cellspacing="0">
                <tbody>
                    <tr>
                        <td style="vertical-align: top;">
                            Unidade de coordenadas
                        </td>
                        <td style="vertical-align: top;">
                            Esta opci&oacute;n permite seleccionar a unidade de coordenadas que se usar&aacute; no di&aacute;logo de propiedades. Pode escoller:
                            <ul>
                                <li>
                                    Porcentaxe: As coordenadas (X, Y, largo e alto) expr&eacute;sanse en porcentaxes
                                </li>
                                <li>
                                    P&iacute;xel: As coordenadas (X, Y, largo e alto) expr&eacute;sanse en p&iacute;xels relativos a unha pantalla en modo 1080p
                                </li>
                            </ul>
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Posici&oacute;n do obxecto
                        </td>
                        <td style="vertical-align: top;">
                            Esta opci&oacute;n perm&iacute;telle axustar as posici&oacute;ns que ocupar&aacute;n os novos obxectos inseridos na li&ntilde;a de tempo.
                            <ul>
                                <li>
                                    Se selecciona <I><B>Inserir ap&oacute;s o obxecto actual</B></I> as novas dispositivas crearanse ap&oacute;s a diapositiva actual.
                                </li>
                                <li>
                                    Se selecciona <I><B>Engadir no final do proxecto</B></I>, as novas diapositivas crearanse no final do proxecto.
                                </li>
                            </ul>
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Eliminaci&oacute;n de obxectos
                        </td>
                        <td style="vertical-align: top;">
                            Se est&aacute; marcada esta caixa, presentar&aacute;selle unha petici&oacute;n de confirmaci&oacute;n cada vez que retire un obxecto.
                            <ul>
                                <li>
                                    Unha diapositiva na xanela principal
                                </li>
                                <li>
                                    Unha toma ou un bloque na xanela de di&aacute;logo de propiedades da diapositiva
                                </li>
                            </ul>
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Recorte do v&iacute;deo
                        </td>
                        <td style="vertical-align: top;">
                            Se est&aacute; marcada a opci&oacute;n <B>Recortar automaticamente o v&iacute;deo 1920x1088 a 1920x1080</B> as imaxes de v&iacute;deo recortaranse automaticamente.
                            <br>
                            Observaci&oacute;n: Alg&uacute;ns fabricantes producen v&iacute;deos FullHD 1920×1088 no canto de 1920×1080. Fano as&iacute; para acelerar a codificaci&oacute;n xa que &eacute; m&aacute;is r&aacute;pido cun m&uacute;ltiplo de 16 li&ntilde;as. Mais este tama&ntilde;o non mant&eacute;n a relaci&oacute;n de aspecto 16:9. Para manter a imaxe enteira, no s&oacute; se deforma a imaxe para encaixala na pantalla, sen&oacute;n que ademais aparecen bandas negras nos laterais. Para evitar todos estes problemas, ao marcar esta caixa, estes v&iacute;deos redond&eacute;anse para seren xerados con tama&ntilde;os 1920×1080 . Para isto c&oacute;rtanse 4 li&ntilde;as na parte superior e inferior.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Desentrelazado do v&iacute;deo
                        </td>
                        <td style="vertical-align: top;">
                            Se est&aacute; marcada a opci&oacute;n <B>Activar o filtro de desentrelazado cando se engaden novos v&iacute;deos MTS</B> activarase automaticamente o filtro de desentrelazado para todos os v&iacute;deos .mts engadidos ao proxecto.
                            <br>
                            Observaci&oacute;n: Alg&uacute;ns fabricantes producen v&iacute;deos utilizando o modo entrelazado. Fano as&iacute; para acelerar a codificaci&oacute;n. O problema &eacute; que deforma a imaxe, na que aparecen as li&ntilde;as movidas. Para obter m&aacute;is informaci&oacute;n sobre o v&iacute;deo entrelazado, consulte esta p&aacute;xina da Wikipedia:
                            <a href="http://en.wikipedia.org/wiki/Interlaced_video">
                                v&iacute;deo entrelazado
                            </a>
                        </td>
                    </tr>
                </tbody>
            </table>
            <br>
            <h3>
                Axustes da rede
            </h3>
            <table border="1" cellpadding="2" cellspacing="0">
                <tbody>
                    <tr>
                        <td style="vertical-align: top;">
                            Usar un proxy para acceder a Internet
                        </td>
                        <td style="vertical-align: top;">
                            Marque esta caixa se a rede require o uso dun proxy.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Enderezo do proxy
                        </td>
                        <td style="vertical-align: top;">
                            Escriba o enderezo do proxy.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Porto do proxy
                        </td>
                        <td style="vertical-align: top;">
                            Escriba o n&uacute;mero do porto para acceder ao proxy ou d&eacute;ixeo en branco para utilizar o porto predeterminado.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Acceso
                        </td>
                        <td style="vertical-align: top;">
                            Escriba o nome do usuario para acceder ao proxy ou d&eacute;ixeo en branco se non require autenticaci&oacute;n.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Contrasinal
                        </td>
                        <td style="vertical-align: top;">
                            Escriba o contrasinal para acceder ao proxy ou d&eacute;ixeo en branco se non require autenticaci&oacute;n.
                        </td>
                    </tr>
                </tbody>
            </table>
            <br>
            <h3>
                Opci&oacute;ns varias
            </h3>
            <table border="1" cellpadding="2" cellspacing="0">
                <tbody>
                    <tr>
                        <td style="vertical-align: top;">
                            Formato curto de data
                        </td>
                        <td style="vertical-align: top;">
                            Esta opci&oacute;n permite especificar o formato no que se amosan as datas calculadas. 
                            <br>
                            Normalmente, este formato depende do idioma que se utiliza no sistema, mais pode ser &uacute;til para cambialo se a interface non est&aacute; dispo&ntilde;&iacute;bel para o seu idioma.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Unidade de distancia
                        </td>
                        <td style="vertical-align: top;">
                            Esta opci&oacute;n permite especificar a unidade que se usar&aacute; para las distancias.
                        </td>
                    </tr>
                </tbody>
            </table>
            <br>
        </div>
        <h2>
            Opci&oacute;ns do proxecto
        </h2>
        <div style="margin-left: 40px;">
            <div>
                A lapela &laquo;Opci&oacute;ns do proxecto&raquo; permite definir as opci&oacute;ns predeterminadas do proxecto actual e para os novos proxectos.
            </div>
            <h3>
                Propiedades do proxecto
            </h3>
            <table border="1" cellpadding="2" cellspacing="0">
                <tbody>
                    <tr>
                        <td style="vertical-align: top;">
                            T&iacute;tulo
                        </td>
                        <td style="vertical-align: top;">
                            Definir o m&eacute;todo de recheo autom&aacute;tico para utilizar nas propiedades do t&iacute;tulo do proxecto :
                            <ul>
                                <li>
                                    Sen recheo autom&aacute;tico: Ter&aacute; que definir manualmente o t&iacute;tulo
                                </li>
                                <li>
                                    Encher co nome do proxecto ao gardar o proxecto: O t&iacute;tulo ter&aacute; o mesmo nome que o ficheiro .ffd
                                </li>
                                <li>
                                    Encher co nome do cartafol do proxecto ao gardar o proxecto: o t&iacute;tulo ter&aacute; o mesmo nome que o cartafol no que se garde o ficheiro .ffd
                                </li>
                            </ul>
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            &Aacute;lbum
                        </td>
                        <td style="vertical-align: top;">
                            Define o valor predeterminado para o campo &laquo;&Aacute;lbum&raquo;
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Autor
                        </td>
                        <td style="vertical-align: top;">
                            Define o valor predeterminado co campo Autor, chamado tam&eacute;n Artista por 
                            <a href="http://en.wikipedia.org/wiki/Media_center">
                                Sistemas &laquo;Centro multimedia&raquo;
                            </a>
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Idioma predeterminado
                        </td>
                        <td style="vertical-align: top;">
                            Define o valor predeterminado para o campo &laquo;Idioma&raquo;
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Mellorar a compatibilidade con id3v2
                        </td>
                        <td style="vertical-align: top;">
                            Para maior compatibilidade co est&aacute;ndar id3v2, marque esta caixa para limitar os campos de T&iacute;tulo, Autor e &Aacute;lbum a 30 caracteres
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Miniatura predeterminada
                        </td>
                        <td style="vertical-align: top;">
                            Define o uso do modelo como miniatura predeterminada. As miniaturas son imaxes que se xeran xunto cos v&iacute;deos. Estas imaxes adoitan utilizarse como carteis
                            <a href="http://en.wikipedia.org/wiki/Media_center">
                                Sistemas &laquo;Centro multimedia&raquo;
                            </a>
                            . 
                            <br>
                            Para obter m&aacute;is informaci&oacute;n sobre anexar ficheiros, vexa <a href="003A.html">Ficheiros anexos</a>
                        </td>
                    </tr>
                </tbody>
            </table>
            <br>
            <h3>
                Opci&oacute;ns do proxecto
            </h3>
            <table border="1" cellpadding="2" cellspacing="0">
                <tbody>
                    <tr>
                        <td style="vertical-align: top;">
                            Xeometr&iacute;a do novo proxecto
                        </td>
                        <td style="vertical-align: top;">
                            Seleccionar a xeometr&iacute;a da imaxe a ser utilizada para a creaci&oacute;n de proxectos. Hai tres xeometr&iacute;as dispo&ntilde;&iacute;beis:
                            <ul>
                                <li>
                                    4:3: Corresponde a pantallas que son (case) cadradas dos antigos TV
                                </li>
                                <li>
                                    16:9: Corresponde a pantallas rectangulares dos TV modernos
                                </li>
                                <li>
                                    2.35:1: Corresponde ao formato do cine (nun televisor, este formato usar&aacute; bandas negras na parte superior e inferior).
                                </li>
                            </ul>
                             Nota: a xeometr&iacute;a dun proxecto def&iacute;nese unha vez por todas cando se crea. Non &eacute; pos&iacute;bel modificala posteriormente.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Duraci&oacute;n predeterminada da 1<SUP>ª</SUP> toma
                        </td>
                        <td style="vertical-align: top;">
                            Estabelece a duraci&oacute;n predeterminada da primeira toma de diapositivas durante a s&uacute;a creaci&oacute;n.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Duraci&oacute;n da seguinte toma
                        </td>
                        <td style="vertical-align: top;">
                            Define a duraci&oacute;n predeterminada para as tomas.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Transici&oacute;n predeterminada
                        </td>
                        <td style="vertical-align: top;">
                            Define a transici&oacute;n para ser inserida entre as diapositivas inseridas:
                            <ul>
                                <li>
                                    <img src="img/random.png">
                                     Unha transici&oacute;n escollida ao chou da galer&iacute;a
                                </li>
                                <li>
                                    <img src="img/Transitions/tr-00-00.png">
                                     Sen transici&oacute;n
                                </li>
                                <li>
                                    <img src="img/Transitions/tr-00-01.png">
                                     Transici&oacute;n de fundido
                                </li>
                            </ul>
                        </td>
                    </tr>
                </tbody>
            </table>
            <br>
            <h3>
                Opci&oacute;ns predeterminadas para as curvas de velocidade
            </h3>
            <table border="1" cellpadding="2" cellspacing="0">
                <tbody>
                    <tr>
                        <td nowrap>
                            Transici&oacute;n
                        </td>
                        <td>
                            Estabelece a curva de velocidade predeterminada para as transici&oacute;ns dos novos proxectos
                        </td>
                    </tr>
                    <tr>
                        <td nowrap>
                            Animaci&oacute;n dos bloques
                        </td>
                        <td>
                            Estabelece a curva de velocidade predeterminada para as animaci&oacute;ns de bloques nos novos proxectos
                        </td>
                    </tr>
                    <tr>
                        <td nowrap>
                            Animaci&oacute;n da imaxe
                        </td>
                        <td>
                            Estabelece a velocidade predeterminada para os efectos de animaci&oacute;n das imaxes nos novos proxectos
                        </td>
                    </tr>
                </tbody>
            </table>
            <br>
            <h3>
                Opci&oacute;ns predeterminadas para o novo bloque de texto
            </h3>
            <div margin-left: 40px;>
                Este grupo de axustes aplic&aacute;selle aos novos bloques de texto creados no di&aacute;logo de diapositivas por medio de este bot&oacute;n:
                <img src="img/add_text.png">
            </div>
            <table border="1" cellpadding="2" cellspacing="0">
                <tbody>
                    <tr>
                        <td style="vertical-align: top;">
                            Texto
                        </td>
                        <td style="vertical-align: top;">
                            Permite seleccionar o estilo de caracteres aplicado aos bloques de texto novos. Este estilo define o tipo de letra, o seu tama&ntilde;o, a s&uacute;a cor e os efectos de sombra aplicados ao texto.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Fondo
                        </td>
                        <td style="vertical-align: top;">
                            Permite seleccionar o estilo do fondo aplicado aos bloques de texto novos. Este estilo define a transparencia do bloque e o recheo.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Forma
                        </td>
                        <td style="vertical-align: top;">
                            Permite seleccionar o estilo da forma aplicado aos bloques de texto novos. Este estilo define a forma (rect&aacute;ngulo, c&iacute;rculo, ...), o bordo, a opacidade e o efecto de sombra aplicado ao bloque.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Coordenadas
                        </td>
                        <td style="vertical-align: top;">
                            Permite seleccionar, para cada xeometr&iacute;a de proxecto, o estilo da localizaci&oacute;n aplicada aos bloques de texto novos. Este estilo define o tama&ntilde;o, as coordenadas, as rotaci&oacute;ns e a restrici&oacute;n xeom&eacute;trica.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Bloqueo
                        </td>
                        <td style="vertical-align: top;">
                            Permite seleccionar a restrici&oacute;n xeom&eacute;trica aplicada aos novos bloques de texto.
                            <ul>
                                <li>
                                    Desbloquear: A forma do bloque &eacute; libre
                                </li>
                                <li>
                                    Bloquear a xeometr&iacute;a do proxecto: A s&uacute;a forma &eacute; a mesma que a da imaxe
                                </li>
                            </ul>
                        </td>
                    </tr>
                </tbody>
            </table>
            <br>
            <h3>
                Opci&oacute;ns predeterminadas para un bloque novo de imaxe ou v&iacute;deo (cando se crea unha diapositiva)
            </h3>
            <div style="margin-left: 40px;">
                <div>
                    Este grupo de axustes aplic&aacute;selle aos novos bloques de imaxe ou v&iacute;deo creados na xanela principal por medio de este bot&oacute;n:
                    <img src="img/add_image.png">
                </div>
                <div>
                    Os seguintes axustes apl&iacute;canse a todos os formatos de imaxe:
                </div>
                <table border="1" cellpadding="2" cellspacing="0">
                    <tbody>
                        <tr>
                            <td style="vertical-align: top;">
                                Estilo do texto
                            </td>
                            <td style="vertical-align: top;">
                                Permite seleccionar o estilo de caracteres aplicado ao texto dos bloques. Este estilo define o tipo de letra, o seu tama&ntilde;o, a s&uacute;a cor e os efectos de sombra aplicados ao texto.
                            </td>
                        </tr>
                        <tr>
                            <td style="vertical-align: top;">
                                Forma
                            </td>
                            <td style="vertical-align: top;">
                                Permite seleccionar o estilo da forma aplicado aos bloques de texto novos. Este estilo define a forma (rect&aacute;ngulo, c&iacute;rculo, ...), o bordo, a opacidade e o efecto de sombra aplicado ao bloque.
                            </td>
                        </tr>
                    </tbody>
                </table>
                <br>
                <div>
                    Para cada formato de imaxe e para cada xeometr&iacute;a do proxecto, selecciona o estilo de localizaci&oacute;n que aplicar aos novos bloques. Este estilo ref&iacute;rese ao tama&ntilde;o, as coordenadas, as rotaci&oacute;ns e a restrici&oacute;n xeom&eacute;trica.
                </div>
                <div>
                    Seleccionar, para cada formato de imaxe, o estilo de encadre e o estilo de posicionamento para ser aplicado aos novos bloques.
                </div>
                <ul>
                    <li>
                        Os estilos de encadre definen como recortar a imaxe para facela compat&iacute;bel co bloque no se amosa.
                    </li>
                    <li>
                        Os estilos de posicionamento definen o tama&ntilde;o, coordenadas, rotaci&oacute;ns e restrici&oacute;ns xeom&eacute;tricas para aplicar a bloques.
                    </li>
                </ul>
            </div>
            <h3>
                Opci&oacute;ns predeterminadas para o novo bloque de imaxe ou v&iacute;deo (cando se engade un bloque no di&aacute;logo de diapositivas)
            </h3>
            <div style="margin-left: 40px;">
                Este grupo de axustes aplic&aacute;selle aos novos bloques de imaxe ou v&iacute;deo creados no di&aacute;logo de diapositivas por medio de este bot&oacute;n:
                <img src="img/add_image.png">
            </div>
            <div style="margin-left: 40px;">
                A mesma selecci&oacute;n que se aplica ao crear diapositivas.
            </div>
            <br>
        </div>
        <h2>
            Opci&oacute;ns da xeraci&oacute;n do v&iacute;deo
        </h2>
        <div style="margin-left: 40px;">
            <div>
                A lapela &laquo;Opci&oacute;ns da xeraci&oacute;n de v&iacute;deo&raquo; permite definir as opci&oacute;ns predeterminadas a empregar durante a xeraci&oacute;n dos v&iacute;deos.
            </div>
            <h3>
                Nome predeterminado do v&iacute;deo
            </h3>
            <div style="margin-left: 40px;">
                Esta opci&oacute;n permite seleccionar o nome que ser&aacute; proposto como predeterminado durante a xeraci&oacute;n dos v&iacute;deos. Esta opci&oacute;n s&oacute; pode aplicarse se o proxecto foi gardado antes.
            </div>
            <table border="1" cellpadding="2" cellspacing="0">
                <tbody>
                    <tr>
                        <td>
                            Usar o nome do proxecto como nome do v&iacute;deo
                        </td>
                        <td>
                            Se o nome do proxecto &eacute; &laquo;montaxe.ffd&raquo;, ent&oacute;n &laquo;montaxe&raquo; ser&aacute; o nome proposto
                        </td>
                    </tr>
                    <tr>
                        <td>
                            Usar o nome do cartafol do proxecto como nome do v&iacute;deo
                        </td>
                        <td>
                            Se o nome do proxecto &eacute; &laquo;montaxe.ffd&raquo; e gardase no cartafol &laquo;As mi&ntilde;as vacaci&oacute;ns 2011&raquo;, ent&oacute;n &laquo;As mi&ntilde;as vacaci&oacute;ns 2011&raquo; ser&aacute; o nome proposto
                        </td>
                    </tr>
                    <tr>
                        <td>
                            Usar o t&iacute;tulo do proxecto como nome do v&iacute;deo
                        </td>
                        <td>
                            Usar o t&iacute;tulo definido nas propiedades do proxecto como nome do v&iacute;deo
                        </td>
                    </tr>
                </tbody>
            </table>
            <br>
            <h3>
                Opci&oacute;ns predeterminadas de anexi&oacute;n de ficheiros
            </h3>
            <div style="margin-left: 40px;">
                Para obter m&aacute;is informaci&oacute;n sobre anexar ficheiros, vexa <a href="003A.html">Ficheiros anexos</a>
            </div>
            <table border="1" cellpadding="2" cellspacing="0">
                <tbody>
                    <tr>
                        <td>
                            Anexar a miniatura para o ficheiro xerado
                        </td>
                        <td>
                            Se est&aacute; marcada esta caixa, crearase un ficheiro de miniatura co v&iacute;deo.
                        </td>
                    </tr>
                    <tr>
                        <td>
                            Anexar o ficheiro &laquo;.nfo&raquo; de XBMC ao xerar o v&iacute;deo
                        </td>
                        <td>
                            Se est&aacute; marcada esta caixa, crearase un ficheiro &laquo;.nfo&raquo; co v&iacute;deo para o XBMC.
                        </td>
                    </tr>
                </tbody>
            </table>
            <h3>
                Nivel de son predeterminado
            </h3>
            <div style="margin-left: 40px;">
                Estabelece o nivel do volume acadado pola amplificaci&oacute;n para a m&uacute;sica e as pistas de son cando o volume se establece en autom&aacute;tico
            </div>
            <br>
            <h3>
                Opci&oacute;ns predeterminadas para o modo de xeraci&oacute;n do v&iacute;deo
            </h3>
            <table border="1" cellpadding="2" cellspacing="0">
                <tbody>
                    <tr>
                        <td style="vertical-align: top;">
                            Tel&eacute;fono intelixente
                        </td>
                        <td style="vertical-align: top;">
                            Seleccionar o tipo e o modelo predeterminado de equipo cando se preme no bot&oacute;n &laquo;Reprodutor e tel&eacute;fono intelixente&raquo; do men&uacute; &laquo;Xerar v&iacute;deo&raquo;
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Sistema multimedia
                        </td>
                        <td style="vertical-align: top;">
                            Seleccionar o tipo e o modelo predeterminado de equipo cando se preme no bot&oacute;n &laquo;Sistema multimedia&raquo; do men&uacute; &laquo;Xerar v&iacute;deo&raquo;
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Para a WEB
                        </td>
                        <td style="vertical-align: top;">
                            Seleccionar o tipo e o modelo predeterminado de equipo cando se preme no bot&oacute;n &laquo;Para a web&raquo; do men&uacute; &laquo;Xerar v&iacute;deo&raquo;
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Sen perdas
                        </td>
                        <td style="vertical-align: top;">
                            Seleccionar o tama&ntilde;o de imaxe predeterminado que utilizar cando se preme no bot&oacute;n &laquo;Sen perdas&raquo; do men&uacute; &laquo;Xerar v&iacute;deo&raquo;
                        </td>
                    </tr>
                </tbody>
            </table>
            <br>
            <h3>
                Opci&oacute;ns avanzadas e predeterminadas para a xeraci&oacute;n do v&iacute;deo
            </h3>
            <table border="1" cellpadding="2" cellspacing="0">
                <tbody>
                    <tr>
                        <td style="vertical-align: top;">
                            Formato de ficheiro
                        </td>
                        <td style="vertical-align: top;">
                            Selecciona o tipo de ficheiro predeterminado que se utilizar&aacute; para a xeraci&oacute;n da lista proposta.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Norma de v&iacute;deo
                        </td>
                        <td style="vertical-align: top;">
                            Selecciona a norma de v&iacute;deo que usar como predeterminada: PAL ou NTSC
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Formato
                        </td>
                        <td style="vertical-align: top;">
                            Selecciona a imaxe predeterminada que se utilizar&aacute; para a xeraci&oacute;n da lista proposta.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            C&oacute;dec de v&iacute;deo
                        </td>
                        <td style="vertical-align: top;">
                            Selecciona o c&oacute;dec de v&iacute;deo predeterminado que se utilizar&aacute; para a xeraci&oacute;n da lista proposta.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Taxa de bits
                        </td>
                        <td style="vertical-align: top;">
                            Selecciona taxa de bits predeterminada que se utilizar&aacute; para o v&iacute;deo durante a xeraci&oacute;n da lista proposta.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            C&oacute;dec de son
                        </td>
                        <td style="vertical-align: top;">
                            Selecciona o c&oacute;dec de son predeterminado que se utilizar&aacute; para a xeraci&oacute;n da lista proposta.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Taxa de bits
                        </td>
                        <td style="vertical-align: top;">
                            Selecciona taxa de bits predeterminada que se utilizar&aacute; para o son durante xeraci&oacute;n da lista proposta.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Frecuencia
                        </td>
                        <td style="vertical-align: top;">
                            Seleccionar a frecuencia predeterminada que se utilizar&aacute; para o son durante a xeraci&oacute;n do v&iacute;deo.
                        </td>
                    </tr>
                </tbody>
            </table>
            <br>
            <h3>
                Opci&oacute;ns predeterminadas da xeraci&oacute;n da banda sonora
            </h3>
            <table border="1" cellpadding="2" cellspacing="0">
                <tbody>
                    <tr>
                        <td style="vertical-align: top;">
                            Formato de ficheiro
                        </td>
                        <td style="vertical-align: top;">
                            Selecciona o tipo de ficheiro predeterminado que se utilizar&aacute; para a xeraci&oacute;n da lista proposta.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            C&oacute;dec de son
                        </td>
                        <td style="vertical-align: top;">
                            Selecciona o c&oacute;dec de son predeterminado que se utilizar&aacute; para a xeraci&oacute;n da lista proposta.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Taxa de bits
                        </td>
                        <td style="vertical-align: top;">
                            Selecciona taxa de bits predeterminada que se utilizar&aacute; para o son durante xeraci&oacute;n da lista proposta.
                        </td>
                    </tr>
                    <tr>
                        <td style="vertical-align: top;">
                            Frecuencia
                        </td>
                        <td style="vertical-align: top;">
                            Seleccionar a frecuencia predeterminada que se utilizar&aacute; para o son durante a xeraci&oacute;n do v&iacute;deo.
                        </td>
                    </tr>
                </tbody>
            </table>
            <br>
        </div>
        <h2>
            Outras acci&oacute;ns
        </h2>
        <div style="margin-left: 40px;">
            <div>
                Na parte inferior do di&aacute;logo, estes bot&oacute;ns permiten:
            </div>
            <ul>
                <li>
                    <img src="img/config.png">
                     Comprobar a configuraci&oacute;n permite abrir o di&aacute;logo <a href="0106.html">Comprobar a configuraci&oacute;n</a>
                </li>
                <li>
                    <img src="img/db.png">
                     Xestionar o dispositivo permite abrir o di&aacute;logo  <a href="0102.html">Xestionar os dispositivos</a>
                </li>
            </ul>
        </div>
    </body>
</html>
