<!DOCTYPE html>
<html dir="ltr" lang="gl">
    <head>
        <title>
            Di&aacute;logo para xestionar os dispositivos
        </title>
        <meta content="text/html; charset=UTF-8" http-equiv="content-type">
        <meta http-equiv="Content-Language" content="gl-GL" <meta content="ffDiaporama Team" name="author">
        <link rel="stylesheet" type="text/css" href="wiki.css"/>
    </head>
    <body>
        <div>
            Esta xanela de di&aacute;logo perm&iacute;telle modificar a base de datos de perfiles de equipos.
        </div>
        <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
        <div>
            A base de datos componse realmente de d&uacute;as partes:
        </div>
        <table border="0" cellpadding="2" cellspacing="10">
            <tbody>
                <tr>
                    <td>
                        <img src="img/db.png">
                    </td>
                    <td>
                        A base de datos predeterminada (fornecida co ffDiaporama). Estes dispositivos est&aacute;n rexistrados no ficheiro de configuraci&oacute;n global de ffDiaporama.
                    </td>
                </tr>
                <tr>
                    <td>
                        <img src="img/db_update.png">
                    </td>
                    <td>
                        Os dispositivos que modifique ou engada. Estes at&oacute;panse rexistrados no ficheiro de configuraci&oacute;n persoal.
                    </td>
                </tr>
            </tbody>
        </table>
        <div>
            <br>
            A zona de tipo de dispositivo perm&iacute;telle seleccionar o tipo de equipo que &eacute; amosado na lista.
        </div>
        <div>
            <br>
            A lista amosa as categor&iacute;as e os tipos de dispositivos presentes na base de datos.
        </div>
        <table border="0" cellpadding="2" cellspacing="10">
            <tbody>
                <tr>
                    <td>
                        <img src="img/db.png">
                    </td>
                    <td>
                        Os dispositivos precedidos por esta icona est&aacute;n definidos na base de datos predeterminada.
                    </td>
                </tr>
                <tr>
                    <td>
                        <img src="img/db_update.png">
                    </td>
                    <td>
                        Os dispositivos precedidos por esta icona son os definidos por vostede, ou os da base de datos predeterminada que foron modificados.
                    </td>
                </tr>
            </tbody>
        </table>
        <div>
            <br>
            Os seguintes bot&oacute;ns permiten actuar sobre a base de datos:
        </div>
        <table border="0" cellpadding="2" cellspacing="10">
            <tbody>
                <tr>
                    <td>
                        <img src="img/db_add.png">
                    </td>
                    <td>
                        Engadir dispositivo: Perm&iacute;telle crear un novo dispositivo para engadilo na base de datos.
                        <br>
                        A creaci&oacute;n dun novo dispositivo faise en 3 pasos: 
                        <ol>
                            <li>
                                Primeiro ten que crear o dispositivo
                            </li>
                            <li>
                                Definir varios par&aacute;metros
                            </li>
                            <li>
                                Premer o bot&oacute;n &laquo;Aplicar as modificaci&oacute;ns&raquo; para rexistrar os par&aacute;metros
                            </li>
                        </ol>
                    </td>
                </tr>
                <tr>
                    <td>
                        <img src="img/db_remove.png">
                    </td>
                    <td>
                        Retirar o dispositivo: Perm&iacute;telle eliminar o dispositivo.
                        <br>
                        Te&ntilde;a en conta que s&oacute; pode eliminar os dispositivos que te&ntilde;a creado, que son os que se amosan con esta icona:
                        <img src="img/db_update.png">
                    </td>
                </tr>
                <tr>
                    <td>
                        <img src="img/db_status.png">
                    </td>
                    <td>
                        Restabelecer a valores predeterminados: Cancela as modificaci&oacute;ns que se fixeron nun dispositivo definido na base de datos predeterminada no ffDiaporama
                    </td>
                </tr>
            </tbody>
        </table>
        <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
        <h4>
            Observaci&oacute;ns:
        </h4>
        <table border="0" cellpadding="2" cellspacing="10">
            <tbody>
                <tr>
                    <td nowrap valign="top">
                        Subtipo de dispositivo
                    </td>
                    <td>
                        Perm&iacute;telle seleccionar a categor&iacute;a na que clasificar o equipamento
                    </td>
                </tr>
                <tr>
                    <td nowrap valign="top">
                        Modelo do dispositivo
                    </td>
                    <td>
                        Introduza aqu&iacute; o nome do dispositivo (campo de entrada de texto libre) e, a seguir, introduza todos os par&aacute;metros necesarios para a xeraci&oacute;n de v&iacute;deos que estean asociados co perfil do dispositivo (formato do ficheiro, norma de v&iacute;deo, etc)
                    </td>
                </tr>
            </tbody>
        </table>
    </body>
</html>
