<!DOCTYPE html>
<html dir="ltr" lang="gl">
    <head>
        <title>
            Engadir ou modificar unha diapositiva predefinida de t&iacute;tulo
        </title>
        <meta content="text/html; charset=UTF-8" http-equiv="content-type">
        <meta http-equiv="Content-Language" content="gl-GL" <meta content="ffDiaporama Team" name="author">
        <link rel="stylesheet" type="text/css" href="wiki.css"/>
    </head>
    <body>
        <div>
            Este di&aacute;logo perm&iacute;telle seleccionar un modelo e definir a informaci&oacute;n do cap&iacute;tulo de diapositivas predefinidas de t&iacute;tulo.
        </div>
        <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
        <div>
            Para entender as diferenzas entre <B><I>Diapositivas predefinidas de t&iacute;tulo</I></B> e <B><I>Diapositivas est&aacute;ndar</I></B>, consulte: <a href="0012.html">Diapositiva predefinida de t&iacute;tulo</a>
        </div>
        <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
        <div>
            Na parte superior da xanela, os dous par&aacute;metros seguintes perm&iacute;tenlle filtrar a diapositiva predefinida de t&iacute;tulo que se amosar&aacute; na &aacute;rea de selecci&oacute;n.
        </div>
        <table border="0" cellpadding="0" cellspacing="10">
            <tbody>
                <tr>
                    <td nowrap valign="top">
                        Tipo de diapositiva
                    </td>
                    <td>
                        Pode seleccionar entre:
                        <table border="1" cellpadding="2" cellspacing="0">
                            <tbody>
                                <tr>
                                    <td nowrap valign="top">
                                        <img src="img/object_text.png">
                                        T&iacute;tulo do proxecto
                                    </td>
                                    <td>
                                        Este tipo de diapositiva usase xeralmente no principio do proxecto como cr&eacute;ditos iniciais. 
                                        <br>
                                        As vari&aacute;beis de textos que son utilizadas polos modelos deste tipo de diapositivas base&aacute;ndose unicamente na informaci&oacute;n do proxecto. Para obter m&aacute;is informaci&oacute;n sobre a informaci&oacute;n do proxecto, consulte: <a href="0108.html">Propiedades do proxecto</a>
                                    </td>
                                </tr>
                                <tr>
                                    <td nowrap valign="top">
                                        <img src="img/Chapter_big.png">
                                        T&iacute;tulo do cap&iacute;tulo
                                    </td>
                                    <td>
                                        Este tipo de diapositiva utilizase polo xeral varias veces no proxecto para marcar o comezo do cap&iacute;tulo. 
                                        <br>
                                        As vari&aacute;beis de textos que son utilizadas polos modelos deste tipo de diapositivas bas&eacute;anse na informaci&oacute;n do proxecto e na informaci&oacute;n do cap&iacute;tulo.
                                    </td>
                                </tr>
                                <tr>
                                    <td nowrap valign="top">
                                        <img src="img/medal.png">
                                        T&iacute;tulo do cr&eacute;dito
                                    </td>
                                    <td>
                                        Este tipo de diapositiva usase xeralmente no final do proxecto como cr&eacute;ditos finais. 
                                        <br>
                                        As vari&aacute;beis de textos que son utilizadas polos modelos deste tipo de diapositiva calc&uacute;lanse automaticamente. Para obter m&aacute;is informaci&oacute;n sobre as vari&aacute;beis de textos, consulte: <a href="0013.html">Vari&aacute;beis din&aacute;micas</a>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </td>
                </tr>
                <tr>
                    <td nowrap valign="top">
                        Categor&iacute;a
                    </td>
                    <td>
                        Pode seleccionar entre:
                        <table border="1" cellpadding="2" cellspacing="0">
                            <tbody>
                                <tr>
                                    <td nowrap valign="top">
                                        Modelos est&aacute;ticos
                                    </td>
                                    <td>
                                        Este tipo lista os modelos est&aacute;ticos, sen animaci&oacute;n.
                                    </td>
                                </tr>
                                <tr>
                                    <td nowrap valign="top">
                                        Modelos animados
                                    </td>
                                    <td>
                                        Este tipo lista os modelos animados, conte&ntilde;en varias tomas.
                                    </td>
                                </tr>
                                <tr>
                                    <td nowrap valign="top">
                                        Modelos personalizados
                                    </td>
                                    <td>
                                        Este tipo lista os modelos que foron gardados coa funci&oacute;n <B><I>Gardar como modelo</I></B> na xanela <a href="0119.html">Propiedades de diapositiva</a>.
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </td>
                </tr>
            </tbody>
        </table>
        <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
        <div>
             A zona de selecci&oacute;n amosa os modelos que corresponden ao tipo e categor&iacute;a que foi seleccionado anteriormente.
            <ul>
                <li>
                    Os modelos am&oacute;sanse e reprod&uacute;cense para que poida ver a diapositiva tal e como aparecer&aacute; no proxecto, co contido das vari&aacute;beis din&aacute;micas.
                </li>
                <li>
                    A duraci&oacute;n de la diapositiva amosase na parte inferior de cada miniatura de modelo.
                </li>
            </ul>
        </div>
        <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
        <div>
            Cando fai a selecci&oacute;n do modelo, ten dispo&ntilde;&iacute;beis os seguintes axustes, se o tipo de diapositiva &eacute; <B><I>Modelo de cap&iacute;tulo</I></B>:
        </div>
        <table border="1" cellpadding="2" cellspacing="0">
            <tbody>
                <tr>
                    <td nowrap valign="top">
                        Nome do cap&iacute;tulo
                    </td>
                    <td>
                        Escriba o nome do cap&iacute;tulo.
                    </td>
                </tr>
                <tr>
                    <td nowrap valign="top">
                        Data do cap&iacute;tulo diferente da data do proxecto
                    </td>
                    <td>
                        Se esta caixa est&aacute; marcada, a data do cap&iacute;tulo &eacute; diferente da data do proxecto.
                        <br>
                        Observaci&oacute;n: Adoita seren &uacute;til para diferenciar a data do cap&iacute;tulo da data do proxecto.
                        <br>
                        Por exemplo, se o proxecto &eacute; <U>As mi&ntilde;as vacaci&oacute;ns do 1 ao 15</U>, o cap&iacute;tulo pode seren limitado a <U>3</U>.
                    </td>
                </tr>
                <tr>
                    <td nowrap valign="top">
                        Data da actividade
                    </td>
                    <td>
                        Seleccionar unha data para o cap&iacute;tulo.
                        <br>
                        Observaci&oacute;n: Este campo activase s&oacute; se a caixa <I><B>Data do cap&iacute;tulo diferente da data do proxecto</B></I> est&aacute; marcada.
                    </td>
                </tr>
                <tr>
                    <td nowrap valign="top">
                        Substitu&iacute;r a data
                    </td>
                    <td>
                        Active esta caixa para substitu&iacute;r a data, co que ofrecer&aacute;selle a posibilidade de introducir unha data como texto libre de varias li&ntilde;as.
                        <br>
                        Observaci&oacute;n: Este campo activase s&oacute; se a caixa <I><B>Data do cap&iacute;tulo diferente da data do proxecto</B></I> est&aacute; marcada.
                    </td>
                </tr>
                <tr>
                    <td style="vertical-align: top;">
                        Localizaci&oacute;n do cap&iacute;tulo diferente da localizaci&oacute;n do proxecto
                    </td>
                    <td>
                        Se esta caixa est&aacute; marcada, a localizaci&oacute;n do cap&iacute;tulo &eacute; diferente da localizaci&oacute;n do proxecto.
                        <br>
                        Observaci&oacute;n: Adoita seren &uacute;til para diferenciar a localizaci&oacute;n do cap&iacute;tulo da localizaci&oacute;n do proxecto.
                        <br>
                        Por exemplo, se a localizaci&oacute;n do proxecto &eacute; <U>onde aluguei casa para as vacaci&oacute;ns</U>, a localizaci&oacute;n do cap&iacute;tulo pode ser <U>onde fun de excursi&oacute;n</U>.
                    </td>
                </tr>
                <tr>
                    <td nowrap valign="top">
                        Localizaci&oacute;n da actividade
                    </td>
                    <td>
                        A localizaci&oacute;n onde se levou a cabo a actividade deste cap&iacute;tulo
                        <ul>
                            <li>
                                Prema neste 
                                <img src="img/EditGMaps.png">
                                 bot&oacute;n para seleccionar unha localizaci&oacute;n no di&aacute;logo <a href="0123.html">Engadir ou modificar unha localizaci&oacute;n</a>, ou usar un favorito
                            </li>
                            <li>
                                Prema neste 
                                <img src="img/trash.png">
                                 bot&oacute;n para retirar a localizaci&oacute;n actual (estabelecido como baleiro)
                            </li>
                        </ul>
                        <br>
                        Observaci&oacute;n: Estes campos e bot&oacute;ns act&iacute;vanse s&oacute; se a caixa <I><B>Localizaci&oacute;n do cap&iacute;tulo diferente da localizaci&oacute;n do proxecto</B></I> est&aacute; marcada.
                    </td>
                </tr>
            </tbody>
        </table>
        <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
        <div>
            Baixo estes axustes, os dous bot&oacute;ns seguintes perm&iacute;tenlle:
        </div>
        <table border="1" cellpadding="2" cellspacing="0">
            <tbody>
                <tr>
                    <td nowrap valign="top">
                        <img src="img/PrjProperties.png">
                         Propiedades do proxecto
                    </td>
                    <td>
                        Este bot&oacute;n perm&iacute;telle abrir o di&aacute;logo <a href="0108.html">Propiedades do proyecto</a>
                    </td>
                </tr>
                <tr>
                    <td nowrap valign="top">
                        <img src="img/transparent.png">
                         Converter a diapositiva est&aacute;ndar
                    </td>
                    <td>
                        Este bot&oacute;n permite converter esta diapositiva nunha diapositiva est&aacute;ndar, que son completamente personaliz&aacute;beis.
                    </td>
                </tr>
            </tbody>
        </table>
    </body>
</html>
