<!DOCTYPE html>
<html dir="ltr" lang="gl">
    <head>
        <title>
            Corrixir, reencadrar ou cortar a imaxe ou v&iacute;deo
        </title>
        <meta content="text/html; charset=UTF-8" http-equiv="content-type">
        <meta http-equiv="Content-Language" content="gl-GL" <meta content="ffDiaporama Team" name="author">
        <link rel="stylesheet" type="text/css" href="wiki.css"/>
    </head>
    <body>
        <div>
            Esta xanela de di&aacute;logo perm&iacute;telle:
        </div>
        <ul>
            <li>
                Cambiar o encadre da imaxe (seleccionar unha parte da imaxe).
            </li>
            <li>
                Xirar a imaxe (cambiar ou restabelecer a orientaci&oacute;n vertical/horizontal).
            </li>
            <li>
                Correcci&oacute;n de imaxe (cambiar a cor e/ou os par&aacute;metros de exposici&oacute;n), e tam&eacute;n a aplicaci&oacute;n de filtros gr&aacute;ficos.
            </li>
            <li>
                Definir o principio e a fin dunha secuencia de v&iacute;deo.
            </li>
            <li>
                Definir un mapa de Google Maps
            </li>
        </ul>
        <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
        <div>
            esta xanela de di&aacute;logo est&aacute; organizada en lapelas que est&aacute;n dispo&ntilde;&iacute;beis en funci&oacute;n do tipo de obxecto que se queira editar.
        </div>
        <ul>
            <li>
                <a href="#IMAGETAG">A etiqueta de imaxe corrixida e reencadrada</a> est&aacute; dispo&ntilde;&iacute;bel con todos os tipos de obxecto
            </li>
            <li>
                <a href="#VIDEOTAG">A etiqueta de v&iacute;deo</a> est&aacute; dispo&ntilde;&iacute;bel s&oacute; para os obxectos de v&iacute;deo
            </li>
            <li>
                <a href="#GMAPSMAPTAG">A etiqueta de mapa de Google Maps</a> s&oacute; est&aacute; dispo&ntilde;&iacute;bel para obxectos de mapa de Google Maps
            </li>
        </ul>
        <div style="margin-left: 20px;">
            Para obter m&aacute;is informaci&oacute;n sobre os tipos de obxecto dispo&ntilde;&iacute;beis vexa: <a href="0045.html">Tipos de obxecto en ffDiaporama</a>
        </div>
        <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
        <h2>
            <a name="IMAGETAG">
                <img src="img/EditImage.png">
                 Etiqueta de correcci&oacute;n e reencadre de imaxe
            </a>
        </h2>
        <div style="margin-left: 40px;">
            <div>
                Esta lapela est&aacute; dispo&ntilde;&iacute;bel tanto para imaxes como para v&iacute;deos. Div&iacute;dese en d&uacute;as partes:
            </div>
            <ul>
                <li>
                    &Aacute; esquerda: A &aacute;rea interactiva
                </li>
                <li>
                    &Aacute; dereita: A &aacute;rea de axustes
                </li>
            </ul>
            <div>
                Na parte inferior da zona interactiva, &eacute; unha &aacute;rea para cambiar o ficheiro de imaxe ou v&iacute;deo:
            </div>
            <div style="margin-left: 40px;">
                <img src="img/FolderOpen.png">
                 Este bot&oacute;n perm&iacute;telle cambiar o ficheiro
                <br>
                Aviso! Se substit&uacute;e un ficheiro (imaxe ou v&iacute;deo) con outro cunha xeometr&iacute;a de imaxe diferente, ter&aacute; que revisar o encadre da imaxe en todas as tomas.
            </div>
            <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
            <div>
                Na parte inferior da xanela de di&aacute;logo:
            </div>
            <div style="margin-left: 40px;">
                <img src="img/ruler_ok.png">
                 Este bot&oacute;n activa ou desactiva as gu&iacute;as magn&eacute;ticas. Cando est&aacute;n activadas as gu&iacute;as, o rato axustarase automaticamente aos bordos da foto, o que facilita o encadre. 
            </div>
            <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
            <h3>
                A &aacute;rea interactiva
            </h3>
            <div style="margin-left: 40px;">
                Pode utilizar a zona interactiva para axustar o encadre co rato ou co teclado:
            </div>
            <table border="1" cellpadding="2" cellspacing="0">
                <tbody>
                    <tr>
                        <td valign="top">
                            Co rato
                        </td>
                        <td>
                            Prema nun dos controladores e, co bot&oacute;n premido, arrastre o rato para modificar o tama&ntilde;o (para aumentar ou reducir a parte da imaxe que quere manter).
                            <br>
                            Prema na imaxe e, co bot&oacute;n premido, arrastre o rato para modificar a parte da imaxe que quere manter.
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            Co teclado
                        </td>
                        <td>
                            Use as frechas para mover a parte da imaxe que quere manter.
                            <br>
                            Utilice MAI&Uacute;S+frechas para mover o control do canto superior esquerdo ou CTRL+frechas para mover o control do canto inferior dereito, para cambiar o tama&ntilde;o da parte que quere manter.
                        </td>
                    </tr>
                </tbody>
            </table>
            <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
            <h3>
                A &aacute;rea de axustes - Encadre e forma
            </h3>
            <table border="1" cellpadding="2" cellspacing="0">
                <tbody>
                    <tr>
                        <td valign="top">
                            <img src="img/Geometry.png">
                        </td>
                        <td>
                            Permite seleccionar un encadre dunha lista de encadres predefinidos. Os encadres clasif&iacute;canse en diferentes categor&iacute;as:
                            <br>
                            <br>
                            <table border="1" cellpadding="2" cellspacing="0" class="background">
                                <tbody>
                                    <tr>
                                        <td valign="top">
                                            <img src="img/Geometry_ProjectLock.png">
                                        </td>
                                        <td nowrap valign="top">
                                            Bloqueo da xeometr&iacute;a do proxecto
                                        </td>
                                        <td valign="top">
                                            Bloquear o rect&aacute;ngulo de selecci&oacute;n que encadra a imaxe para a mesma xeometr&iacute;a que o proxecto. Se coloca a imaxe a pantalla completa, a parte reencadrada corresponder&aacute; a toda a pantalla.
                                        </td>
                                    </tr>
                                    <tr>
                                        <td valign="top">
                                            <img src="img/Geometry_ImageLock.png">
                                        </td>
                                        <td nowrap valign="top">
                                            Bloqueo da xeometr&iacute;a da imaxe
                                        </td>
                                        <td valign="top">
                                            Bloquear a selecci&oacute;n rectangular de encadre da imaxe para a mesma xeometr&iacute;a que a imaxe
                                        </td>
                                    </tr>
                                    <tr>
                                        <td valign="top">
                                            <img src="img/Geometry_Unlock.png">
                                        </td>
                                        <td nowrap valign="top">
                                            Sen restrici&oacute;ns
                                        </td>
                                        <td valign="top">
                                            Non se aplica ningunha restrici&oacute;n ao rect&aacute;ngulo de selecci&oacute;n da imaxe encadrada. 
                                        </td>
                                    </tr>
                                    <tr>
                                        <td valign="top">
                                            <img src="img/Geometry_Lock.png">
                                        </td>
                                        <td nowrap valign="top">
                                            Bloquear esta xeometr&iacute;a
                                        </td>
                                        <td valign="top">
                                            Bloquear a selecci&oacute;n rectangular de encadre da imaxe como a xeometr&iacute;a actual. Isto s&oacute; ten sentido cando unha forma foi definida no modo &laquo;sen restrici&oacute;ns&raquo;.
                                        </td>
                                    </tr>
                                </tbody>
                            </table>
                            <br>
                            Segundo o formato da imaxe, propor&aacute;nselle varias opci&oacute;ns. Por exemplo:
                            <div style="margin-left: 40px;">
                                <img src="wiki_img/AutoFraming1.png">
                                <img src="wiki_img/AutoFraming2.png">
                            </div>
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            Forma
                        </td>
                        <td>
                            Seleccione unha forma para o bloque actual.
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            <img src="img/PosSize_X.png">
                        </td>
                        <td>
                            A posici&oacute;n horizontal desde a esquerda (X). Esta posici&oacute;n expresase como unha porcentaxe (%) do largo da imaxe.
                            <br>
                            Exemplo: se X=25%, ent&oacute;n &eacute; eliminado o 1ยบ cuarto &aacute; esquerda da imaxe.
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            <img src="img/PosSize_Y.png">
                        </td>
                        <td>
                            A posici&oacute;n vertical desde arriba (Y). Esta posici&oacute;n expresase como unha porcentaxe (%) do alto da imaxe.
                            <br>
                            Exemplo: se X=25%, &eacute; eliminado o 1ยบ cuarto da parte superior da imaxe.
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            <img src="img/PosSize_Width.png">
                        </td>
                        <td>
                            O largo. Este valor expresase como unha porcentaxe (%) do largo orixinal da imaxe.
                            <br>
                            Exemplo: Se Largo=33%, a imaxe reencadrada representar&aacute; un terzo do orixinal.
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            <img src="img/PosSize_Height.png">
                        </td>
                        <td>
                            O alto. Este valor expresase como unha porcentaxe (%) do alto orixinal da imaxe.
                            <br>
                            Exemplo: Se Alto=33%, a imaxe reencadrada representar&aacute; un terzo do orixinal.
                        </td>
                    </tr>
                </tbody>
            </table>
            <div style="margin-left: 40px;">
                <h4>
                    Observaci&oacute;ns:
                </h4>
                <ul>
                    <li>
                        Pode utilizar os bot&oacute;ns + e - en cada campo de entrada para cambiar a configuraci&oacute;n ou introducir os valores directamente para os catro par&aacute;metros.
                    </li>
                    <li>
                        Cando a imaxe non se corresponde coa xeometr&iacute;a do v&iacute;deo que vai seren xerado, aparecen zonas transparentes. Por exemplo: unha imaxe 4:3 utilizada nun proxecto de 16:9 amosase de xeito predeterminado con unha zona transparente en cada lado.
                    </li>
                </ul>
            </div>
            <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
            <h3>
                A &aacute;rea de axustes - Axustes de animaci&oacute;n
            </h3>
            <table border="1" cellpadding="2" cellspacing="0">
                <tbody>
                    <tr>
                        <td valign="top">
                            Curva de velocidade
                        </td>
                        <td>
                            Defina a curva de velocidade das animaci&oacute;ns de imaxes.
                        </td>
                    </tr>
                </tbody>
            </table>
            <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
            <h3>
                A &aacute;rea de axustes - Rotaci&oacute;n da imaxe
            </h3>
            <table border="0" cellpadding="0" cellspacing="5">
                <tbody>
                    <tr>
                        <td valign="top">
                            <img src="img/RotateZ.png">
                        </td>
                        <td>
                            O &aacute;ngulo de rotaci&oacute;n para o eixe z. Esta posici&oacute;n expresase en graos. Exemplo: Se a rotaci&oacute;n=90&deg;, a imaxe xira un cuarto &aacute; dereita.
                        </td>
                    </tr>
                    <tr>
                        <td>
                            <img src="img/rotationg.png">
                        </td>
                        <td>
                            Xirar a imaxe &aacute; esquerda (ao seguinte m&uacute;ltiplo de 90&deg;).
                        </td>
                    </tr>
                    <tr>
                        <td>
                            <img src="img/rotationd.png">
                        </td>
                        <td>
                            Xirar a imaxe &aacute; dereita (ao seguinte m&uacute;ltiplo de 90&deg;).
                        </td>
                    </tr>
                </tbody>
            </table>
            <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
            <h3>
                A &aacute;rea de axustes - Luminosidade, contraste, gama e mellora da cor
            </h3>
            <table border="0" cellpadding="0" cellspacing="5">
                <tbody>
                    <tr>
                        <td valign="top">
                            <img src="img/Filter/Brightness.png">
                        </td>
                        <td>
                            Perm&iacute;telle aumentar ou reducir a luminosidade da imaxe
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            <img src="img/Filter/Contrast.png">
                        </td>
                        <td>
                            Perm&iacute;telle aumentar ou reducir o contraste da imaxe
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            <img src="img/Filter/Gamma.png">
                        </td>
                        <td>
                            Perm&iacute;telle aumentar ou reducir o valor gamma da imaxe
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            <img src="img/Filter/Grayscale.png">
                        </td>
                        <td>
                            Perm&iacute;telle activar o filtro da escala de grises (branco e negro).
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            <img src="img/Filter/Equalize.png">
                        </td>
                        <td>
                            Perm&iacute;telle activar o filtro de ecualizaci&oacute;n (histograma de ecualizaci&oacute;n).
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            <img src="img/Red.png">
                        </td>
                        <td>
                            Perm&iacute;telle modificar a coloraci&oacute;n dunha imaxe cambiando a cor vermella primaria. Exemplo: A reduci&oacute;n do compo&ntilde;ente vermello fai que a imaxe sexa m&aacute;is amarela, pola contra, o aumento fai que a imaxe sexa m&aacute;is vermella
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            <img src="img/Green.png">
                        </td>
                        <td>
                            Perm&iacute;telle modificar a coloraci&oacute;n dunha imaxe cambiando a cor verde primaria. Exemplo: A reduci&oacute;n do compo&ntilde;ente verde fai que a imaxe sexa m&aacute;is vermella, pola contra, o aumento fai que a imaxe sexa m&aacute;is verde
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            <img src="img/Blue.png">
                        </td>
                        <td>
                            Perm&iacute;telle modificar a coloraci&oacute;n dunha imaxe cambiando a cor azul primaria. Exemplo: A reduci&oacute;n do compo&ntilde;ente verde fai que a imaxe sexa m&aacute;is vermella, pola contra, o aumento fai que a imaxe sexa m&aacute;is azul
                        </td>
                    </tr>
                </tbody>
            </table>
            <div style="margin-left: 40px;">
                <br>
                <h4>
                    Observaci&oacute;ns:
                </h4>
                <ul>
                    <li>
                        Son pos&iacute;beis todas as combinaci&oacute;ns. Por exemplo: Pode aumentar o vermello e reducir o verde de vez. Os resultados dependen dos valores iniciais dos compo&ntilde;entes da cor primaria da imaxe orixinal.
                    </li>
                    <li>
                        <img src="img/undo.png">
                         Este bot&oacute;n permite restabelecer a cero o valor todos os valores de correcci&oacute;n.
                    </li>
                </ul>
            </div>
            <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
            <h3>
                A &aacute;rea de axustes - Mellora da imaxe
            </h3>
            <div style="margin-left: 40px;">
                 Aplicar un filtro &aacute;s imaxes fotogr&aacute;ficas ou de v&iacute;deo. Est&aacute;n dispo&ntilde;&iacute;beis os seguintes filtros: 
            </div>
            <table border="0" cellpadding="0" cellspacing="5">
                <tbody>
                    <tr>
                        <td valign="top">
                            <img src="img/Filter/Blur.png">
                        </td>
                        <td>
                            Difuso/Nidio
                            <ul>
                                <li>
                                    Tipo: Seleccionar o algoritmo do difuso/nidio
                                </li>
                                <li>
                                    Aumentar a falta de definici&oacute;n cun valor negativo, usando radio.
                                </li>
                                <li>
                                    Aumentar a nitidez cun valor positivo, usando radio.
                                </li>
                            </ul>
                            <div style="margin-left: 20px;">
                                <img src="img/undo.png">
                                 Este bot&oacute;n perm&iacute;telle restabelecer o valor a cero. (Nalg&uacute;ns par&aacute;metros de transformaci&oacute;n.)
                            </div>
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            <img src="img/Filter/Despeckle.png">
                        </td>
                        <td>
                            Perm&iacute;telle activar o filtro de reduci&oacute;n do ru&iacute;do.
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            <img src="img/Filter/Antialias.png">
                        </td>
                        <td>
                            Perm&iacute;telle activar o filtro de suavizado (minimizando a distorsi&oacute;n por artefactos).
                        </td>
                    </tr>
                </tbody>
            </table>
            <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
            <h3>
                A &aacute;rea de axustes - Efectos art&iacute;sticos
            </h3>
            <div style="margin-left: 40px;">
                 Aplicar un filtro &aacute;s imaxes fotogr&aacute;ficas ou de v&iacute;deo. Est&aacute;n dispo&ntilde;&iacute;beis os seguintes filtros: 
            </div>
            <table border="0" cellpadding="0" cellspacing="5">
                <tbody>
                    <tr>
                        <td valign="top">
                            <img src="img/Filter/Negative.png">
                        </td>
                        <td>
                            Perm&iacute;telle activar o filtro negativo.
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            <img src="img/Filter/Emboss.png">
                        </td>
                        <td>
                            Perm&iacute;telle activar o filtro de relevo.
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            <img src="img/Filter/Edge.png">
                        </td>
                        <td>
                            Perm&iacute;telle activar o filtro de bordo.
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            <img src="img/Filter/Charcoal.png">
                        </td>
                        <td>
                            Perm&iacute;telle activar o filtro de carbonizo.
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            <img src="img/Filter/Oilpaint.png">
                        </td>
                        <td>
                            Perm&iacute;telle activar o filtro de pintura ao &oacute;leo.
                        </td>
                    </tr>
                </tbody>
            </table>
            <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
            <h3>
                A &aacute;rea de axustes - Distorsi&oacute;n da imaxe
            </h3>
            <div style="margin-left: 40px;">
                 Aplicar un filtro &aacute;s imaxes fotogr&aacute;ficas ou de v&iacute;deo. Est&aacute;n dispo&ntilde;&iacute;beis os seguintes filtros: 
            </div>
            <table border="0" cellpadding="0" cellspacing="5">
                <tbody>
                    <tr>
                        <td valign="top">
                            <img src="img/Filter/Swirl.png">
                        </td>
                        <td>
                            Perm&iacute;telle activar a transformaci&oacute;n de remu&iacute;&ntilde;o. A imaxe de remu&iacute;&ntilde;o &eacute; unha deformaci&oacute;n non lineal da imaxe que crea un efecto de remu&iacute;&ntilde;o.
                        </td>
                    </tr>
                    <tr>
                        <td valign="top">
                            <img src="img/Filter/Implode.png">
                        </td>
                        <td>
                            Perm&iacute;telle activar a transformaci&oacute;n de implosi&oacute;n
                        </td>
                    </tr>
                </tbody>
            </table>
            <div style="margin-left: 40px;">
                <h4>
                    Observaci&oacute;ns:
                </h4>
                <ul>
                    <li>
                        Un valor de 0 desactiva o filtro.
                    </li>
                    <li>
                        Un valor negativo ou positivo activa o filtro nunha direcci&oacute;n ou noutra.
                    </li>
                    <li>
                        <img src="img/undo.png">
                         Este bot&oacute;n permite que el valor sexa restabelecido a cero.
                    </li>
                </ul>
            </div>
            <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
        </div>
        <br>
        <h2>
            <a name="VIDEOTAG">
                <img src="img/EditMovie.png">
                 A etiqueta de v&iacute;deo
            </a>
        </h2>
        <div style="margin-left: 40px;">
            <div>
                Esta etiqueta s&oacute; est&aacute; dispo&ntilde;&iacute;bel para v&iacute;deo.
            </div>
            <h3>
                A barra de progreso
            </h3>
            <ul>
                <li>
                    Amosa o seguinte: 
                    <ul>
                        <li>
                            A forma de onda do son do v&iacute;deo amosase baixo un fondo branco.
                        </li>
                        <li>
                            A regra que representa a duraci&oacute;n do v&iacute;deo amosase baixo un fondo negro. Observe que a lonxitude da regra incrementase en proporci&oacute;n &aacute; duraci&oacute;n do v&iacute;deo.
                        </li>
                        <li>
                            A parte azul, na forma de onda e na regra, representa a parte do v&iacute;deo que se selecciona (que se utiliza na montaxe).
                        </li>
                    </ul>
                </li>
                <li>
                    <img src="img/player_play_small.png">
                     Este bot&oacute;n inicia a reproduci&oacute;n. Prema outra vez nel para facer unha pausa.
                    <img src="img/player_pause_small.png">
                </li>
                <li>
                    Pode mover co rato o
                    <img src="wiki_img/PosBT.png">
                     tirador, na barra de progreso, para mover a posici&oacute;n actual
                </li>
                <li>
                    Pode mover co rato os dous
                    <img src="wiki_img/StartBT.png">
                     
                    <img src="wiki_img/EndBT.png">
                     tiradores, na barra de progreso, para mover as posici&oacute;ns de inicio e fin
                </li>
            </ul>
            <h3>
                O intervalo de traballo
            </h3>
            <ul>
                <li>
                    <img src="img/player_rew.png">
                     Coloca o cursor no punto de inicio
                </li>
                <li>
                    <img src="img/PosStart.png">
                     Utiliza a posici&oacute;n actual como punto de inicio (fai unha edici&oacute;n)
                </li>
                <li>
                    <img src="img/player_fwd.png">
                     Coloca o cursor no punto de fin
                </li>
                <li>
                    <img src="img/PosEnd.png">
                     Utiliza a posici&oacute;n actual como punto de fin (fai unha edici&oacute;n)
                </li>
            </ul>
            <h3>
                A zona de axustes adicionais
            </h3>
            <ul>
                <li>
                    <B>Volumen</B> perm&iacute;telle definir o &laquo;Volume mestre&raquo; para o ficheiro
                </li>
                <li>
                    <B>Desentrelazar o v&iacute;deo</B> perm&iacute;telle activar o filtro para desentrelazar
                </li>
            </ul>
        </div>
        <br>
        <h2>
            <a name="GMAPSMAPTAG">
                <img src="img/EditGMaps.png">
                 A etiqueta do mapa de Google Maps
            </a>
        </h2>
        <div style="margin-left: 40px;">
            <div>
                Esta etiqueta s&oacute; est&aacute; dispo&ntilde;&iacute;bel para os mapas de Google Maps.
            </div>
            <ul>
                <li>
                    Na parte superior esquerda, def&iacute;nense as propiedades do mapa
                </li>
                <li>
                    Na parte inferior esquerda, presentase o mapa con marcadores
                </li>
                <li>
                    Na parte superior dereita, presentase a t&aacute;boa de localizaci&oacute;n
                </li>
                <li>
                    Na parte inferior dereita, def&iacute;nense as propiedades da localizaci&oacute;n seleccionada
                </li>
            </ul>
            <h3>
                As propiedades do mapa
            </h3>
            <div style="margin-left: 40px;">
                <table border="0" cellpadding="0" cellspacing="5">
                    <tbody>
                        <tr>
                            <td valign="top">
                                Tipo de mapa
                            </td>
                            <td>
                                Definir o tipo de mapa. Pode seleccionar entre as catro posibilidades de Google Maps:
                                <ul>
                                    <li>
                                        Mapa de estradas
                                    </li>
                                    <li>
                                        Sat&eacute;lite
                                    </li>
                                    <li>
                                        Terreo
                                    </li>
                                    <li>
                                        H&iacute;brido
                                    </li>
                                </ul>
                            </td>
                        </tr>
                        <tr>
                            <td valign="top">
                                Tama&ntilde;o do mapa:
                            </td>
                            <td>
                                Definir o tama&ntilde;o do mapa. Este tama&ntilde;o representa a distancia en largo e alto do mapa.
                                <ul>
                                    <li>
                                        Diminu&iacute;r o zoom e aumentar a &aacute;rea representada polo mapa.
                                    </li>
                                    <li>
                                        Aumentar o zoom e diminu&iacute;r a &aacute;rea representada polo mapa.
                                    </li>
                                </ul>
                            </td>
                        </tr>
                        <tr>
                            <td valign="top">
                                Tama&ntilde;o da imaxe
                            </td>
                            <td>
                                Definir o tama&ntilde;o da imaxe xerada polo mapa. ffDiaporama prop&oacute;n xerar mapas de varios tama&ntilde;os, polo que, para crear unha animaci&oacute;n de zoom flu&iacute;do p&oacute;dese utilizar unha imaxe de gran tama&ntilde;o.
                            </td>
                        </tr>
                    </tbody>
                </table>
            </div>
            <br>
            <h3>
                A t&aacute;boa de localizaci&oacute;ns
            </h3>
            <div style="margin-left: 40px;">
                <table border="0" cellpadding="0" cellspacing="5">
                    <tbody>
                        <tr>
                            <td valign="top">
                                <img src="img/gmap_add.png">
                            </td>
                            <td>
                                Seleccione unha localizaci&oacute;n no di&aacute;logo <a href="0123.html">Engadir ou modificar unha localizaci&oacute;n</a>, ou usar un favorito
                            </td>
                        </tr>
                        <tr>
                            <td valign="top">
                                <img src="img/action_edit.png">
                            </td>
                            <td>
                                Editar a localizaci&oacute;n actual. Abra o di&aacute;logo <a href="0123.html">Engadir ou modificar unha localizaci&oacute;n</a>.
                            </td>
                        </tr>
                        <tr>
                            <td valign="top">
                                <img src="img/trash.png">
                            </td>
                            <td>
                                Retirar a localizaci&oacute;n actual.
                            </td>
                        </tr>
                    </tbody>
                </table>
            </div>
            <br>
            <h3>
                As propiedades do marcador
            </h3>
            <div style="margin-left: 40px;">
                <h4>
                    Propiedades para todas as tomas
                </h4>
                <div>
                    Este grupo de axustes define as propiedades para todas as tomas, polo que, as modificaci&oacute;ns realizadas &aacute;s seguintes propiedades aplicaranse a todas as tomas. Para entender as diferenzas entre as propiedades que se aplican a todas as tomas e as que s&oacute; se aplican &aacute; toma actual, consulte: <a href="0010.html">Como traballa o ffDiaporama</a>.
                </div>
                <table border="0" cellpadding="0" cellspacing="5">
                    <tbody>
                        <tr>
                            <td valign="top">
                                Forma de posici&oacute;n GPS
                            </td>
                            <td>
                                Definir unha forma para a posici&oacute;n GPS
                            </td>
                        </tr>
                        <tr>
                            <td valign="top">
                                Forma do marcador
                            </td>
                            <td>
                                Definir unha forma para o marcador
                            </td>
                        </tr>
                        <tr>
                            <td valign="top">
                                Composici&oacute;n
                            </td>
                            <td>
                                Definir que informaci&oacute;n vai amosarse no marcador
                            </td>
                        </tr>
                        <tr>
                            <td valign="top">
                                Tama&ntilde;o
                            </td>
                            <td>
                                Definir o tama&ntilde;o do marcador e da posici&oacute;n GPS
                            </td>
                        </tr>
                        <tr>
                            <td valign="top">
                                Distancia
                            </td>
                            <td>
                                Definir onde amosar o marcador (a distancia entre o marcador e a posici&oacute;n GPS)
                            </td>
                        </tr>
                    </tbody>
                </table>
                <br>
                <h4>
                    Propiedades para esta toma
                </h4>
                <div>
                    Este grupo de axustes define as propiedades da toma actual, polo que pode crear a animaci&oacute;n dos marcadores definindo as diferentes propiedades de cada toma.
                </div>
                <table border="0" cellpadding="0" cellspacing="5">
                    <tbody>
                        <tr>
                            <td valign="top">
                                Cor do texto
                            </td>
                            <td>
                                Definir a cor do texto
                            </td>
                        </tr>
                        <tr>
                            <td valign="top">
                                Cor do fondo
                            </td>
                            <td>
                                Definir a cor do fondo do marcador, da posici&oacute;n GPS e da &aacute;rea entre os dous
                            </td>
                        </tr>
                        <tr>
                            <td valign="top">
                                Cor da li&ntilde;a
                            </td>
                            <td>
                                Definir a cor do bordo
                            </td>
                        </tr>
                        <tr>
                            <td valign="top">
                                Visibilidade
                            </td>
                            <td>
                                Definir se o marcador &eacute; vis&iacute;bel, semivis&iacute;bel (enmascarado) ou agochado
                            </td>
                        </tr>
                    </tbody>
                </table>
            </div>
        </div>
        <br>
        <h2>
            Vexa tam&eacute;n
        </h2>
        <table border="0" cellpadding="0" cellspacing="0">
            <tbody>
                <tr>
                    <td valign="top">
                        <img src="wiki_img/Wikipedia.png">
                    </td>
                    <td valign="top">
                        <ul>
                            <li>
                                <a href="http://en.wikipedia.org/wiki/Ken_Burns_effect">
                                    Efectos Ken Burns
                                </a>
                            </li>
                            <li>
                                <a href="http://en.wikipedia.org/wiki/Histogram_equalization">
                                    Filtro: Histograma de ecualizaci&oacute;n
                                </a>
                            </li>
                            <li>
                                <a href="http://en.wikipedia.org/wiki/Despeckle">
                                    Filtro: Reducci&oacute;n de ruido
                                </a>
                            </li>
                        </ul>
                    </td>
                </tr>
            </tbody>
        </table>
    </body>
</html>
