<!DOCTYPE html>
<html dir="ltr" lang="gl">
    <head>
        <title>
            Propiedades da m&uacute;sica
        </title>
        <meta content="text/html; charset=UTF-8" http-equiv="content-type">
        <meta http-equiv="Content-Language" content="gl-GL" <meta content="ffDiaporama Team" name="author">
        <link rel="stylesheet" type="text/css" href="wiki.css"/>
    </head>
    <body>
        <div>
            O di&aacute;logo de &laquo;propiedades da m&uacute;sica&raquo; permite especificar a pista de m&uacute;sica.
        </div>
        <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
        <h2>
            Principios de funcionamento
        </h2>
        <div style="margin-left: 40px;">
             O principio de funcionamento m&aacute;is importante das pistas de m&uacute;sica &eacute; que mentres non cambien os axustes, apl&iacute;canse os axustes previos. Por lo tanto, se:
            <ul>
                <li>
                    Diapositiva 1 - Define unha lista de reproduci&oacute;n
                </li>
                <li>
                    Diapositiva 2 - Non cont&eacute;n ning&uacute;n axuste
                </li>
                <li>
                    Diapositiva 3 - Non cont&eacute;n ning&uacute;n axuste
                </li>
                <li>
                    Diapositiva 1 - Define unha lista de reproduci&oacute;n
                </li>
                <li>
                    Diapositiva 5 - Non cont&eacute;n ning&uacute;n axuste
                </li>
            </ul>
            <div>
                Ent&oacute;n:
            </div>
            <ul>
                <li>
                    As diapositivas 2 e 3 contin&uacute;an reproducindo a lista definida na diapositiva 1
                </li>
                <li>
                    A diapositiva 5 contin&uacute;a reproducindo a lista definida na diapositiva 4
                </li>
            </ul>
        </div>
        <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
        <h2>
            Axustes da pista de m&uacute;sica (zona superior da xanela de di&aacute;logo)
        </h2>
        <div style="margin-left: 40px;">
            As seguintes opci&oacute;ns apl&iacute;canse &aacute; m&uacute;sica actual na diapositiva:
        </div>
        <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
        <div style="margin-left: 40px;">
            <table border="0" cellpadding="0" cellspacing="5">
                <tbody>
                    <tr>
                        <td nowrap valign="top">
                            Normal
                        </td>
                        <td>
                            Sen configuraci&oacute;n espec&iacute;fica
                        </td>
                    </tr>
                    <tr>
                        <td nowrap valign="top">
                            Cambiar o nivel do son
                        </td>
                        <td>
                            Especifica que o volume do son red&uacute;cese durante esta diapositiva. (Esta opci&oacute;n &eacute; particularmente &uacute;til, por exemplo, para reducir o son da m&uacute;sica durante a reproduci&oacute;n dun v&iacute;deo.)
                        </td>
                    </tr>
                    <tr>
                        <td nowrap valign="top">
                            Po&ntilde;er en pausa
                        </td>
                        <td>
                            Deter a lista de reproduci&oacute;n actual
                        </td>
                    </tr>
                </tbody>
            </table>
        </div>
        <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
        <h2>
            A lista de reproduci&oacute;n (parte inferior da xanela de di&aacute;logo)
        </h2>
        <div style="margin-left: 40px;">
            <h3>
                Iniciar unha nova lista de reproduci&oacute;n
            </h3>
            <div style="margin-left: 40px;">
                Perm&iacute;telle crear unha nova lista de reproduci&oacute;n. Se unha lista definida nunha diapositiva anterior, a&iacute;nda est&aacute; en reproduci&oacute;n, detense cun efecto de fundido de sa&iacute;da (diminuci&oacute;n progresiva do volume do son ata o silencio)
            </div>
            <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
            <div style="margin-left: 40px;">
                 Esta secci&oacute;n da lista de reproduci&oacute;n consiste en d&uacute;as partes:
                <ul>
                    <li>
                        A barra de ferramentas cont&eacute;n os controles para a lista de reproduci&oacute;n
                    </li>
                    <li>
                        A lista de ficheiros de m&uacute;sica que compo&ntilde;en a lista de reproduci&oacute;n
                    </li>
                </ul>
                <h3>
                    A barra de ferramentas
                </h3>
                <table border="0" cellpadding="0" cellspacing="5">
                    <tbody>
                        <tr>
                            <td>
                                <img src="img/add_sound.png">
                            </td>
                            <td>
                                Engade un ficheiro &aacute; lista de reproduci&oacute;n. Aparecer&aacute; un di&aacute;logo de selecci&oacute;n de ficheiros para permitir a selecci&oacute;n.
                            </td>
                        </tr>
                        <tr>
                            <td>
                                <img src="img/EditSound.png">
                            </td>
                            <td>
                                Cortar o ficheiro seleccionado da lista de reproduci&oacute;n. Aparecer&aacute; o di&aacute;logo <a href="0124.html">Cortar un ficheiro de son</a>.
                            </td>
                        </tr>
                        <tr>
                            <td>
                                <img src="img/trash.png">
                            </td>
                            <td>
                                Retirar o ficheiro seleccionado da lista de reproducci&oacute;n.
                            </td>
                        </tr>
                        <tr>
                            <td>
                                <img src="img/arrow_up.png">
                            </td>
                            <td>
                                Cambia a orde na que se reproducir&aacute;n os ficheiros de m&uacute;sica. Move o ficheiro seleccionado un paso cara arriba.
                            </td>
                        </tr>
                        <tr>
                            <td>
                                <img src="img/arrow_down.png">
                            </td>
                            <td>
                                Cambia a orde na que se reproducir&aacute;n os ficheiros de m&uacute;sica. Move o ficheiro seleccionado un paso cara abaixo.
                            </td>
                        </tr>
                    </tbody>
                </table>
                <h3>
                    A lista de reproduci&oacute;n
                </h3>
                <div style="margin-left: 40px;">
                    <div>
                        Os ficheiros de m&uacute;sica am&oacute;sanse na orde na que se reproducir&aacute;n, de arriba abaixo.
                    </div>
                    <div>
                        A columna de Volume define o &laquo;volume mestre&raquo; para o ficheiro. Este volume &eacute; independente de calquera reduci&oacute;n no volume que se defina na parte superior do di&aacute;logo.
                    </div>
                    <div>
                        A columna de Cr&eacute;ditos define se o ficheiro debe aparecer ou non cando se utiliza a vari&aacute;bel %STM% nun t&iacute;tulo de cr&eacute;dito. Para obter m&aacute;is informaci&oacute;n sobre as vari&aacute;beis, consulte: <a href="0013.html">Vari&aacute;beis din&aacute;micas</a>
                    </div>
                </div>
            </div>
            <span style="background-color:#FFFF00;"> <div>&nbsp;</div> </span>
            <h3>
                Observaci&oacute;ns
            </h3>
            <div style="margin-left: 40px;">
                Os efectos de fundidos de entrada/sa&iacute;da e o aumento/diminuci&oacute;n do volume real&iacute;zanse durante as transici&oacute;ns das diapositivas que entran. En consecuencia:
                <ul>
                    <li>
                        Duran o mesmo tempo que a transici&oacute;n de entrada.
                    </li>
                    <li>
                        Se unha diapositiva ten unha transici&oacute;n de entrada configurada como &laquo;Sen transici&oacute;n&raquo;, o efecto de son non &eacute; progresivo, sen&oacute;n instant&aacute;neo.
                    </li>
                </ul>
            </div>
            <div style="margin-left: 40px;">
                Pode premer d&uacute;as veces nun ficheiro de m&uacute;sica da lista de reproduci&oacute;n para editalo, aparecer&aacute; o di&aacute;logo <a href="0124.html">Cortar un ficheiro de son</a>.
            </div>
        </div>
    </body>
</html>
