<!DOCTYPE html>
<html dir="ltr" lang="gl">
    <head>
        <title>
            Propiedades das transici&oacute;ns
        </title>
        <meta content="text/html; charset=UTF-8" http-equiv="content-type">
        <meta http-equiv="Content-Language" content="gl-GL" <meta content="ffDiaporama Team" name="author">
        <link rel="stylesheet" type="text/css" href="wiki.css"/>
    </head>
    <body>
        <div>
             Este di&aacute;logo perm&iacute;telle definir a transici&oacute;n de entrada para unha diapositiva:
            <br>
            Amosa unha vista previa das transici&oacute;ns dispo&ntilde;&iacute;beis por familias de transici&oacute;ns.
            <br>
            Observaci&oacute;n: No caso de abrirse este di&aacute;logo para unha selecci&oacute;n m&uacute;ltiple de diapositivas, a primeira diapositiva seleccionada ser&aacute; a utilizada para a vista previa.
        </div>
        <br>
        <table border="0" cellpadding="0" cellspacing="10">
            <tbody>
                <tr>
                    <td valign="top">
                        Tipo de transici&oacute;n
                    </td>
                    <td>
                        Permite seleccionar unha familia de transici&oacute;ns.
                        <table border="1" cellpadding="2" cellspacing="0">
                            <tbody>
                                <tr>
                                    <td nowrap valign="top">
                                        Sen transici&oacute;n
                                    </td>
                                    <td>
                                        Sen transici&oacute;n: A nova diapositiva substit&uacute;e inmediatamente a anterior.
                                        <br>
                                        Te&ntilde;a en conta que neste caso, tam&eacute;n foi desactivado:
                                        <ul>
                                            <li>
                                                Esvaecemento do son (a lista de reproduci&oacute;n da nova diapositiva substit&uacute;e inmediatamente &aacute; da anterior)
                                            </li>
                                            <li>
                                                Transici&oacute;ns de fondo
                                            </li>
                                        </ul>
                                    </td>
                                </tr>
                                <tr>
                                    <td nowrap valign="top">
                                        B&aacute;sico
                                    </td>
                                    <td>
                                        Efecto de disoluci&oacute;n: A diapositiva aparece progresivamente, a s&uacute;a opacidade aumenta progresivamente.
                                    </td>
                                </tr>
                                <tr>
                                    <td nowrap valign="top">
                                        Transici&oacute;ns programadas
                                    </td>
                                    <td>
                                        Achegar: A nova diapositiva aparece de forma cada vez m&aacute;is grande, mentres que a antiga desaparece cun efecto de disoluci&oacute;n.
                                        <br>
                                        Esvarar: A nova diapositiva esvara sobre a diapositiva anterior que desaparece cun efecto de disoluci&oacute;n.
                                        <br>
                                        Empurrar: A nova diapositiva toma o lugar da anterior empurr&aacute;ndoa cara un lado.
                                    </td>
                                </tr>
                                <tr>
                                    <td nowrap valign="top">
                                        Transici&oacute;n LUMA
                                    </td>
                                    <td>
                                        A animaci&oacute;n basease nunha m&aacute;scara de luminancia : os puntos m&aacute;is escuros da m&aacute;scara, os puntos correspondentes m&aacute;is r&aacute;pidos da nova dispositiva substit&uacute;en aos da anterior.
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </td>
                </tr>
                <tr>
                    <td nowrap valign="top">
                        Curva de velocidade
                    </td>
                    <td>
                        Permite seleccionar unha curva de velocidade para aplic&aacute;rllela &aacute; transici&oacute;n
                    </td>
                </tr>
                <tr>
                    <td valign="top">
                        Duraci&oacute;n
                    </td>
                    <td>
                        Permite definir a duraci&oacute;n da animaci&oacute;n.
                        <br>
                        As pos&iacute;beis escollas son 0,5 segundos (moi r&aacute;pido) a 10 segundos (moi lento)
                    </td>
                </tr>
            </tbody>
        </table>
        <h2>
            Vexa tam&eacute;n
        </h2>
        <table border="0" cellpadding="0" cellspacing="10">
            <tbody>
                <tr>
                    <td>
                        <img src="wiki_img/Wikipedia.png">
                    </td>
                    <td>
                        <ul>
                            <li>
                                <a href="http://en.wikipedia.org/wiki/Luma_%28video%29">
                                    Descrici&oacute;n de LUMA
                                </a>
                            </li>
                        </ul>
                    </td>
                </tr>
            </tbody>
        </table>
    </body>
</html>
